[
    {
        "url": "https://ticotimes.net/2022/01/31/voting-in-costa-rica-and-the-upcoming-election",
        "date": "January 31, 2022",
        "title": "Voting in Costa Rica and the Upcoming Election",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER As you travel along the roads of Costa Rica you are quickly reminded of the upcoming election. Whether it be a dirt road through a small town or village or a well-traveled route, no one is forgotten as every vote matters. This is because the general election is fast approaching and this Sunday, February 6, 2022 political changes will come to Costa Rica. But how do you become eligible to run for President and how can you still vote if you are a Costa Rican expat?  Lets discuss that and few more topics about the Costa Rica Presidential Elections. Every 4 years Costa Rica runs their direct elections where the country has the right to have their say in the direction Costa Rica will go in. It is at this time the people of Costa Rica will take to the polls to help determine Costa Rica’s next president and Legislative Assembly. However, in order to get on that ballot, there are several mandatory qualifications one must have if you are hoping to vie for the position of President of Costa Rica.  Unlike other country’s the president of Costa Rica cannot run for consecutive 4 year terms. It wasn’t until 2005 when candidates were permitted to run again, if they chose, but had to wait at least 8 years after governing in order to do so.  In order to win the presidential election, one must win at least 40% of the popular vote on February 6, 2022. If history is to repeat itself, this typically does not happen in the first round of votes and a runoff election follows if no one receives the 40%. The two candidates with the most votes will then take to the second-round ballot.  It will then be on April 3, 2022, as this is the required two months after the first round of votes when voters will return to determine who they feel will best govern Costa Rica. However, it is just the decision on who will be the next President that will be determined as the Legislative Assembly was decided on the first vote. The ability to vote has been made easy and accessible, however, making a decision of who you want to mark on your ballot may not come as easy. This national election has a record number of candidates on the ballot this time and may seem a bit overwhelming so being well informed on each candidate is of upmost importance.  There are a few faces many may recognize from the past with  s (National Liberation Party – PLN) seeking a return after serving as former head of state from 1994 – 1998 and Lineth Saborío of the Social Christian Unity Party (PUSC) and former Vice President of 2002-2006.  According to the   it is these familiar candidates leading the forefront of the election with Fabricio Alvarado of the New Republic party (PNR) following closely behind.  The Broad Front (FA) party’s José Maria Villalta and Social Democratic Progress (PSD) party Rodrigo Chaves close up the top 5 positions at the moment but nothing as yet be determined or predicted.  Along with these findings the most recent results from UCR also show that 41% have not yet decided on which candidate they will cast their vote for. That being said many will end up making their decision on who they will vote for in the days leading up to the election or even as they stand stare at the ballot just before voting. If you are not in the country at the time of the election you still have the ability to make a difference in the presidential election. You are eligible to vote in Costa Rica election if you are of the legal age of 18 and possess valid identification regardless whether you are living in Costa Rica or somewhere else in the world.  If you have become a naturalized Costa Rican citizen you are also able to taking advantage of being a citizen and you also have the right to vote.  For those abroad, there are 52 consulates from 42 different countries to allow those overseas to still be a part of your country’s decision. Polling stations have even been set up for registered voters  within Costa Rica to ensure the right to vote for prisoners. Any Costa Rica voter any will tell you that voting is both voluntary and symbolically required. However, it is, in fact, obligatory. However, in reality if you don’t show up at the ballot box there aren’t any legal problems or consequences for not voting as it’s not on the top of the list for those who enforce the issue.  You are more likely to have issues with those around you when complaining about who was elected since you didn’t make the effort to have your say in the matter. With the ever-changing state of the current world conditions, by voting, Costa Rica’s citizens can strive for a new government that will bring forth a sense of stability in an unstable world.  Remember every vote counts so if you are eligible to vote in the upcoming Sunday, February 6, 2022, Costa Rica general election be sure to have your say. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/11/03/costa-rica-wildlife-meet-the-collared-forest-falcon",
        "date": "November 3, 2023",
        "title": "Costa Rica Wildlife – Meet the Collared Forest-Falcon",
        "content": "Today we meet the collared forest-falcon. It’s a pretty bird of prey that likes to eat iguanas and pose for my camera traps. The collared forest-falcon (Micrastur semitorquatus) is known as the   in Spanish, which is a pretty direct translation. Many birds and mammals have   is their Spanish name which generally means of the mountain, of the forest or wild. One time, a Tico friend was explaining the work I do to another Tico guy who was suspect of my ability to spend the entire day in the forest, and he assured him that I was ‘de monte’ and when I overheard it, I could feel a little swell of pride in my chest. In my head, collared forest-falcons are categorized as ‘common uncommon birds of prey.’ Costa Rica is home to many species of hawks, kites, falcons, and eagles. Many of which I have never seen and probably will never see. Others, like the roadside hawk,  , and gray hawk are so common that I can spot all three during the car ride from my house to the grocery store. Collared forest-falcons are somewhere in between. I see and hear them frequently enough that it’s not an ‘Oh my gosh!’ situation, but their presence is always a little more appreciated than the birds that I see on a daily basis. Collared forest-falcons live in a range over much of Costa Rica. They can be found along both coasts and most low laying areas but are absent from the high elevations of the center of the country. As their name points out, they’re usually found in the forest. They hunt in a range of forests from areas with big mature trees to scrubby secondary growth forests. When on the hunt, they perch in the lower levels of the forest, keeping a sharp eye out for their prey. They eat a range of small animals including large lizards, rodents, birds, and even invertebrates flushed out of the forest floor evading army ants. They either spot their prey and pounce down on it before it knows what’s happening or actively chase after it, showing off their speed and agility. I’ve recorded collared forest-falcons on the hunt several times. A few times I’ve recorded them pouncing on  , subduing them with a few bites to the back of the neck, and flying off. Once I recorded one confronting an   at a water source, but the agouti didn’t run away and didn’t look particularly frightened, so I figured they were probably too big to eat. Then, a few years later I recorded a collared forest-falcon very much attempting to ambush an agouti from above (it just missed), so they seem to be on the menu after all. Though they aren’t terribly common, I end up recording more collared forest-falcon videos than I would typically expect. In researching this article, I think I’ve realized why. The low level, mostly horizontal tree limbs without a lot of small branches and leaves in the way are the perfect place for them to perch and search for prey.  Those same tree limbs are low enough that I can climb up there and not die, and they lack the small branches and leaves that would continuously trigger my camera. So, it turns out, we like the same branches. So, click on the video below and meet the ‘common uncommon’ collared forest-falcon. Vincent Losasso, founder of  , is a biologist who works with camera traps throughout Costa Rica. Learn more about his projects on   or  . You can also email him at: "
    },
    {
        "url": "https://ticotimes.net/2023/11/02/costa-ricas-vargas-golden-again-in-hurdles-at-2023-pan-american-games",
        "date": "November 2, 2023",
        "title": "Costa Rica’s Vargas Golden Again in Hurdles at 2023 Pan American Games",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Costa Rican track star Andrea Carolina Vargas cemented her status as one of the region’s top hurdlers by successfully defending her title in the women’s 100-meter hurdles at the 2023 Pan American Games in Santiago, Chile this week. On a wet track at the National Stadium, Vargas pushed through rainy conditions to claim gold with a time of 13.06 seconds. She edged out Cuban rival Greisys Lázara Roble by just 0.03 seconds in a thrilling finish. American Alaysha Johnson took bronze 0.13 seconds behind Vargas. This marks the second straight Pan American gold for the 27-year-old Vargas, who was also champion at the  . She becomes the first Costa Rican athlete to win two consecutive gold medals in the same event at the prestigious competition. “This is an incredibly special moment for me and for my country,” said an emotional Vargas after the race. “To be able to achieve this again, under difficult conditions, fills me with so much pride.” Vargas has been in peak form this season, taking gold at the Ibero-American Championships in May followed by another victory at the   in June. She also holds the Central American and Caribbean record in the 100m hurdles event. But defending her Pan Am title posed a new challenge that Vargas was determined to overcome. “My goal was to go out strong from the first hurdle and maintain my speed throughout,” she said. “I am so grateful I was able to accomplish that.” Vargas’ repeat gold opens the athletics medal count for Costa Rica in impressive fashion. She has shown her world-class talent once again on the international stage. Vargas is an inspiration and role model for youth across the country. “This is for Costa Rica!” declared Vargas as she waved the national flag proudly after her win. With athletes like Vargas leading the way, the future looks bright for Costa Rican athletics. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/10/31/halloween-originates-from-celtic-traditions",
        "date": "October 31, 2023",
        "title": "Halloween’s Origins in Celtic and Christian Traditions",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER In the United States, Halloween has boomed into the second-largest commercial holiday, generating billions in sales annually. While many Costa Ricans have adopted this tradition, others reject it as an unpatriotic or even anti-Catholic tradition. However, the roots of this controversial holiday are neither North American, nor far removed from the scope of Christianity. Halloween was born from the Celts, who populated what is now the United Kingdom, Ireland and northern France more than 2,000 years ago. On the Celtic calendar, Nov. 1marked the beginning of the new year and the winter season. The Celts celebrated their new year on Oct. 31 with a festivity known as Samhuinn or Samhain (pronounced sow-in), meaning “summer’s end.”  Their harsh winters often brought prolonged darkness, hunger and death, conditions which the Celts attributed to spirits from the world of the dead and the unborn that visited the earth on the night of Oct.31.The Celts believed on this night, the veil between this and the otherworld became thin enough to allow Celtic priests, known as Druids, to engage in the art of divination.  On this night, Druids built giant bonfires, around which the Celts gathered to tell their fortunes, wearing animal heads and skins, their versions of our modern-day Halloween costumes. During the 800s, after the Romans had conquered and brought Christianity to Celtic lands, Pope Boniface IV proclaimed Nov. 1 All Saints’ Day, in what many people believe was an attempt to substitute the Samhain festival with a church holiday in honor of saints and martyrs.  The word “Halloween” derives from the middle-English Alholowmesse, meaning All Saints’ Day, which was also referred to as All-hallows or All-hallow mas. Oct. 31 started being called All-hallows Eve and finally, Halloween. Trick-or-treating came along after the church appointed Nov. 2 All Souls’ Day, or the Day of the Dead.  During early All Souls’ Day celebrations in England, poor people begged for food and families would hand them “soul cakes” in exchange for prayers for their deceased relatives.  The church promoted this practice to eliminate the tradition of leaving wine and food to appease wandering spirits. The practice of dressing in costumes evolved from the Samhain festivity. People were afraid to run into spirits who visited the earth on the night of Oct. 31.  They disguised themselves in masks and costumes so spirits would confuse them for other ghosts and not identify them as humans. Halloween’s origins are deeply rooted in  s and have evolved over time to incorporate elements of Christian and secular celebrations. While it may be seen as a controversial holiday in some circles, its rich history and cultural significance cannot be denied. As we continue to celebrate Halloween, it is important to remember its roots and the many ways in which it has been shaped by different cultures and beliefs. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/11/01/costa-rican-cocoa-selected-among-worlds-best",
        "date": "November 1, 2023",
        "title": "Costa Rican Cocoa Selected Among World’s Best",
        "content": "The distinguished Costa Rican cocoa producer, Chocolatera del Volcán, has earned international acclaim by being selected among the top 50 cocoa samples globally in the prestigious “ ” contest. Chocolatera del Volcán’s sample was chosen along with three other Costa Rican offerings to represent the country following a competitive national selection process of over 25 entries in January. This tremendous honor provides valuable recognition of Costa Rica’s emergence as a producer of supreme quality fine cocoa on the world stage. The Vice Minister of Agriculture and Livestock, Fernando Vargas Perez, highlighted the strategic importance of this international distinction for   sector. “This contest represents a strategic opportunity for trend analysis, process standardization, quality improvement, and the global positioning of Costa Rican cocoa in specialized market niches,” he remarked. Vargas Perez added, “In Costa Rica, producers have been diligently preparing and effectively managing the post-harvest phase, promoting quality and a rich diversity of flavors, which has culminated in international recognition as a producer of fine cocoa. This accolade is a testament to our collective efforts.” The widely respected Cocoa of Excellence program featured 222 entries from 52 cocoa-producing nations this year. The competition aims to honor cocoa producers worldwide for their diligent efforts in cultivating quality cocoa during the growing, harvesting, and post-harvest processing phases. The initial evaluation consisted of a meticulous physical assessment of whole and cut cocoa beans by expert judges. This was followed by a thorough sensory analysis of the cocoa liquor which evaluated aroma, flavor, appearance and other attributes based on strict protocols. Costa Rica can take immense pride in   securing its place among the world’s top 50 – a truly monumental accomplishment. But the final chapter of this story remains unwritten. The celebrated samples will now be processed into darkened chocolate which will undergo another round of rigorous blind tastings by an esteemed panel of cocoa and chocolate experts in December 2023. Their sensory analyses will ultimately determine the recipients of the coveted Gold, Silver and Bronze Cacao of Excellence awards to be announced in February 2024. While the waiting game continues, Costa Rica has already emerged victorious by demonstrating to the global cocoa community the supreme caliber of its national produce. Chocolatera del Volcán’s inclusion in the elite top 50 serves as a personal triumph for their team. But even more significantly, it represents a collective milestone and global recognition of Costa Rica’s prominence as a producer of some of the finest cocoa in the world. With the judging finale fast approaching, the shining spotlight has firmly fixated on Costa Rica’s promising cacao sector. Come February, we will eagerly await the final results while taking immense pride in this phenomenal accomplishment of national distinction on the global stage."
    },
    {
        "url": "https://ticotimes.net/2021/09/26/is-costa-rica-dangerous-for-expat-retirees-putting-crime-into-the-proper-perspective",
        "date": "September 26, 2021",
        "title": "Is Costa Rica dangerous for expat retirees?— Putting crime into the proper perspective",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER I am repeatedly asked  by people thinking of relocating here if there is a lot of crime. I have lived in Costa Rica for over 40 years, speak Spanish with native fluency and above all want to want to clear up a lot of erroneous information that is being published on many social media platforms about the subject of expats and crime in Costa Rica. I’d like to point out that I ride the bus, walk the streets, talk to many Costa Ricans, so I am fortunate to be able to have the opportunity to observe daily life first hand. Crime is a difficult subject to address since it has a lot to do with perception and understanding the scope of the problem. Bear in mind that NO country in the world is crime free. If it exists, then please let me know.  I can honestly state that during the time I have lived here I have never been a victim of any crime. Yes, I have made a couple of bad investments and some of my ex-girlfriends have beaten me out of a few bucks, but nothing more than that. So putting everything into proper perspective, Costa Rica is not a dangerous country in which to live.  Yes, there have been cases where a few American tourists have disappeared without leaving a trace. Over the years a handful of expats have been murdered for their possessions or died under mysterious circumstances  According to my contacts at the American embassy, the real danger here is from drowning and not dying as a result of a violent crime.  Despite the warning signs on many  , tourists, Costa Ricans and residents venture into unfamiliar waters and drown every year because of the strong undercurrents. The good news is that the country is in the process of organizing a national   service to try and prevent more deaths Automobile and motorcycle accidents also cause a lot of unnecessary deaths but most of those who die are locals and not foreigners. It is important to make the distinction between “Latino (Costa Rican, Colombian, Nicaraguan, etc.)  on Latino crime” and “Latino on  ” crime in Costa Rica. The latter is miniscule while the former predominates.  The majority of homicides occur among Costa Ricans and people from neighboring countries.  They are usually precipitated by territorial drug wars, revenge, jealously, inebriation, crimes of passion or armed robberies. Expat residents are seldom victims of these types of crimes. Since Costa Rica is a small country when a crime does take place, it is usually sensationalized and blown completely out of proportion by the news-starved local and sometimes international media. For instance, a few weeks ago a North American  was shot to death by the ex-boyfriend of his local girlfriend. Unfortunately, a lot of single men get mixed up with prostitutes, gold diggers or lowlifes who seem to be the easiest women to meet. I have seen this scenario repeated over and over and over during the 40 plus years that I have lived here. I even have coined a term that can be applied in most cases, “  or dumb  .” Many leave their brains on the plane and do things that the never would do in their home countries that include bad investments and getting involved with unsavory characters. They fall in ’lust’ and not in love with the country and drop their guard. Costa Rica is peaceful when we compare it to Mexico which reportedly has around 1,000,000 residents from the United States. Over 250,000 people have died there due to drug violence during the last 15-20 years. In fact, 43  candidates for public office  have been killed so far this year by the ruthless cartels.  Nothing on this scale has EVER occurred in Costa Rica. Yes, we have local drug dealers who kill each other but on a small and far less violent scale than Mexico where murder, mayhem, dismemberment and other heinous crimes are almost an everyday occurrences.  Medellín Colombia which is slowly becoming a new   haven, has double the homicide rate of Costa Rica at about 25 deaths per 100,000 people. When Pablo Escobar was terrorizing the city’s inhabitants the murder rate was a whopping 450 deaths per 100,000.  The city is much safer now even with the current social upheaval. Curiously, a while back I was reading an article that almost every person including foreigners have metal security doors on their homes due to the large number of burglaries. This phenomenon doesn’t seem to be the norm here. According to the media,  in 2021 around 20 foreigners have been murdered in Medellín to date. Let’s not forget that the good old USA is one of the most violent countries in the world since guns are obtained easily. A resident or citizen of Costa Rica can only own three (3) handguns and NO military assault weapons. A handgun permit has to be renewed every two years and includes a thorough psychological exam and evaluation.  Furthermore, to date there have been NO indiscriminate massacres like the ones that are happening almost every week in the United States. Here you can go shopping or to a movie here without having to look over your shoulder for fear of a deranged gunman. I know of a few people who have been mugged over the years, usually in San José. On the other hand, I also have friends who have lived there for many years and never had a single problem nor felt in danger.  Generally it’s a good idea not to carry anything that can’t be easily replaced (passport, laptop, U.S. driver’s license, lots of cash, etc.). Mugging can be avoided, but you have to be smart about it, look like you know where you’re going, and don’t display targeted items like cell phones, digital cameras, or expensive jewelry. Burglary is the most prevalent crime here. Choosing where to live reduces the chance of burglary. Most condo and apartment complexes have good security. ADT and other alarm companies operate here.  I have had ADT for over 20 years without a problem. Their response time is quick even when my alarm is triggered accidently. Many neighborhoods also have night watchman who make the rounds.  Isolated properties that are off the grid are more vulnerable than gated or semi-gated communities or traditional neighborhoods with subdivisions.  Believe me! If thought it was dangerous for my family to live here, I would pack my bags and relocate. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/10/03/an-eco-friendly-medicinal-garden-secret-yellow-bells",
        "date": "October 3, 2021",
        "title": "An eco-friendly, medicinal garden secret in Costa Rica : Yellow Bells",
        "content": "Here’s a colorful, tropical, native ornamental for your garden that doesn’t require dangerous pesticides or chemical fertilizers, nor lots of irrigation in the dry season. It’s called Yellow Bells or Yellow Elder ( ). Costa Ricans call it   or little vanilla. This hardy bush is found in most regions of Costa Rica and easy to identify with its clusters of yellow, bell-shaped flowers and serrated, compound, pinnate leaves with 5 to 13 leaflets. This plant is a member of the family  , and is related to   (  and  ( ) which has similar flowers. Yellow Bell is a patio ornamental that can also be seen along many sidewalks and avenues. By the way, you can often collect seeds from these bushes’ narrow capsules, which somewhat resemble miniature  . The older capsules turn gray and split open, releasing the small brown seeds encased in a white paper sheath. These seeds can be planted in small pots or recycled plastic cups with holes in the bottom and filled with potting soil. In about a week, the seeds should germinate, and in a few months the young seedling plants can be transplanted to a permanent site around the home. Another form of propagation is to take woody stem cuttings from a bush and start them in containers in the greenhouse or plant them directly in the soil where you would like them to grow. The latter should be done in May or June, when the rains keep the soil continually moist. Yellow bells grow and flower best in full sun conditions and can tolerate salt breezes from the beach. They also grow in a wide variety of soils and require very little in terms of soil fertilization. Of course, additions of   and foliar fertilizers help to keep these bushes blooming and growing vigorously. It is common to find them planted as a shrubby, living fence or as a freestanding specimen on the patio. They can be pruned yearly to keep them compact and low, and this hardy native plant doesn’t require special pampering, nor does it suffer from any serious insect problems or plant diseases. And the secret? According to Hernán Rodriguez Navas in his book “  (“Uses of Medicinal Plants in Costa Rica”), the leaves and bark of yellow bells have been used by indigenous people for centuries to treat pain, fevers, and infections. Tea made from the inner bark is a tonic to aid in the treatment of diabetes, kidney aliments and rheumatism. Researchers have named the active ingredient tecomanine. So there you have it: A beautiful, ornamental and natural medicine right in your backyard with less work, better health and more natural harmony in your garden. This article first appeared in 2015"
    },
    {
        "url": "https://ticotimes.net/2021/10/09/30-reasons-why-you-should-not-move-to-costa-rica",
        "date": "October 9, 2021",
        "title": "30 reasons why you shouldn’t move to Costa Rica",
        "content": "Over the years, I have had the opportunity to observe firsthand thousands of foreigners who have relocated to Costa Rica. Many fulfill their of dream of living in paradise by adapting to the country’s culture and taking advantage of all it has to offer. I have heard people say, “I love Costa Rica so much, you could never drag me back to my home country.” Success stories abound here.  For many who move here, it is a chance to start over, develop new hobbies and interests, make friends, find adventure, live in a different culture or study a foreign language. However, things do not always out for some who relocate. According to the Association of Resident of Costa Rica (ARCR) and my sources in the moving business, about 40% of those who come here end up returning home for a variety reasons:  That said, there other reasons why some shouldn’t  in the first place to avoid failure and have to return home. Christopher Howard has been conducting relocation/retirement tours and writing retirement guidebooks for more than 30 years. For information about life in Costa Rica, relocation tours or to have your questions answered,   or contact Christopher Howard at:     call Toll Free 877-884-2502 and in Costa Rica 011-506-8849-0081"
    },
    {
        "url": "https://ticotimes.net/2021/10/10/4-things-you-need-to-know-before-investing-in-a-local-startup",
        "date": "October 10, 2021",
        "title": "4 Things to Know Before Investing in a Costa Rica Startup",
        "content": "Without a doubt, entrepreneurship in Costa Rica has been growing in the past few years, and there are many initiatives that have been contributing to it. From business plan competitions to prototyping events and from structured entrepreneurship training programs like  , to the emergence of dozens of incubators it would seem there’s never been a better time to take the leap and start your own business. Local startups today need many things besides funding, but it is this sole component that grabs most of their attention. They apply to incubators as a means to obtain seed capital from the Banking System for Development (  or gain access to angel investment; they flock in masses to business-plan competitions in hopes of winning the prize of a couple thousand dollars; or, if they are brave enough, they go through the ordeal of navigating the bureaucracy of local banks in order to get flexible loans or microcredits. If you are a potential angel investor, there are many opportunities worth exploring in order to fulfill some of this capital demand, as long as you take some considerations and precautions before embarking on your journey. Before you invest in a local startup, make sure you prepare to cope with these four perks – and quirks – of our entrepreneurial ecosystem: As a result of the lack of venture capital markets in Costa Rica and the fact that businesses here are rarely funded by third party investment (as opposed to savings, loans, and your uncle Francisco’s money), many entrepreneurs do not speak the same language as investors.  There is still a notion that frames investment as a “help” or something that they should get out of good will. The enthusiastic founder in front of you might not think to discuss risk against return, investment horizon and exit strategy, , so you might need to create a common ground on which to negotiate. From my experience, showing entrepreneurs how other startups abroad got their funding helps them understand the tradeoffs associated with bringing an investor on board. Although many entrepreneurs will tell you that money is all they need, make sure you assess the young company’s needs thoroughly before taking the checkbook out. The team might not have all the skills required to run the company, there might be lack of understanding of the market they are trying to serve, or they might be over-optimistic about their cash flows.  Either way, you might have to step in and invest your time, contacts and knowledge to make it take off. Although someone might argue that’s the job of investors everywhere, that type of active involvement might be even more needed in a country like Costa Rica. Even at very early stages of the project (sometimes as early as the idea stage), entrepreneurs will have high hopes for their company’s valuations when it comes to letting equity go. Perhaps more common locally than in other startup ecosystems, you might find what we could call the “emotional premium on equity,” or the excess in price that the owner expects you to pay to compensate for all those nights he worked so hard, the time away from his family, and the uniqueness of his idea.  The truth is that until proven out there in the market, ideas by themselves are rarely worth much, and surely 50% of a company is better than 100% of an idea, but since new entrepreneurs don’t always act (strictly) rationally, you might need to drive a hard bargain. On the bright side, venture capital is still in its infancy in Costa Rica, and although there are lots of people with money, there’s not a culture of investing in startups (most investors come from within families). Many local investors don’t understand the inherent risks and rewards of investing in startups and therefore ask for hefty conditions, such as outrageous percentages of equity that entrepreneurs rarely agree with. So if you keep your head cool and roll with the idiosyncrasies, you might strike yourself a good deal. Costa Rica might not be the Silicon Valley of Latin America (yet), but we’re moving ahead. There’s a very educated workforce that is now finding incentives and programs to help them innovate and turn their ideas into viable businesses. One piece of the puzzle that still seems to be unresolved is the investment, and that’s where many angel investors have an opportunity. Is it the right opportunity for you?"
    },
    {
        "url": "https://ticotimes.net/2021/10/23/16-reasons-why-you-should-move-to-costa-rica",
        "date": "October 23, 2021",
        "title": "16 Reasons Why You Should Move to Costa Rica",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER A few weeks ago I wrote an article about who  . I received a lot of interesting responses from my readers. So, I decided to write a complimentary article about reasons to relocate here. As most people know Costa Rica is a user-friendly country for Americans. For the last 30 years they have been flocking here because of the country’s stellar international reputation, welcoming  people, absence of an army and peaceful democratic tradition. Costa Rica has no enemies nor does it meddle in other country’s affairs. Other pluses that attract foreigners are: one of the best climates in the world, the   lifestyle (which means pure life in its essence and is the national motto), scores of activities to stay busy and happy, unparalleled natural beauty, paradisiacal warm-water beaches, and so much more. Given the above, it comes as no surprise that Costa Rica is tops on the retirement list of retirement havens and has more American residents per capita (proportionately) than any other country in the world. They cannot be wrong! Utopia does not exist but Costa Rica comes close for many expats who have successfully made their home here. I’d like to point out that Costa Rica is not for everyone as I alluded to in a   The best thing to do is to come test drive the country with an open mind, good attitude, sense of humor and explore. This may require several visits of a few weeks or months to find out if you are a candidate for long-term living. For more information about relocating to Costa Rica contact Christopher Howard at:  © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/10/30/expat-life-my-long-journey-to-costa-rica",
        "date": "October 30, 2021",
        "title": "Expat Life: My Long Journey to Costa Rica",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER When I tell people that I have lived in Costa Rica for 42 years, they inevitably ask me, “What brought you here in the first place.” I begin by telling them that my dream to live in paradise began as an undergraduate at U.C.L.A. when I was awarded a scholarship to study in Puebla, Mexico. That experience proved to be a watershed moment as I discover my love for Latin America and its fascinating culture. I immediately knew that I wanted to fulfill my dream by eventually living somewhere south of the border. Thus, the search for my future home began. At the time I was only twenty years old,  had to finish my undergraduate studies and really had no way of supporting myself while living abroad (The possibility of being an Internet nomad and working remotely was not an option then). So, the only choice I had at the time was to become a Spanish teacher and use my three-month summer vacations to continue honing my language skills abroad and to explore Mexico in depth as I searched for a spot where I would eventually settle. During my travels I visited almost every exotic beach and inland region of said country. While roaming around Mexico I came across San Blas — a lovely little fishing village in the State of Nayarit, Mexico. I ended spent two Christmas vacations there soaking up the sun and guzzling Mexican beer. While there I met an American who had traveled by motorcycle through Mexico and Central America.  All he could do was rave about Costa Rica which piqued my curiosity.  I was enamored with Mexico and its people but was always curious to see what the countries to the south were like. So, I bought a ticket to Costa Rica as soon as I had a couple of free weeks to explore the country. In the summer of 1978 I began my maiden voyage on LACSA (Costa Rica’s former national airline).  Upon arrival, I immediately noticed there was something different about the country. I basically traveled around the country blindly since there were no travel guidebooks in print at that time.  First, I visited the capital city of San José. Then on a whim I went to the Shangri-la-like   to the east which proved to be an excellent choice. I then went to Puntarenas, Jacó, Quepos and Manual Antonio. Believe me, at that time it was not easy to get from point A to point B because of the dismal state of the country’s roads and infrastructure. Everything was a real adventure in those days. After my initial trip the country grew on me so I visited almost every chance I could get and stayed a little longer each time. At that point in my life there only remained one more thing I needed to do before choosing Costa Rica: I had to see if there was any other country in Latin America that was better for living.  So, I took a six month leave of absence from my job and set out to explore South America. First, I flew from Costa Rica to Rio de Janeiro. Then I spent a couple weeks touring Argentina with some Argentine friends who I had met in the States. Then I spent the next two months  checking out Uruguay, Chile, Bolivia, Peru, Ecuador and Colombia. All of these countries had something to offer, but as a whole none could “hold a candle” to Costa Rica. Costa Rica’s friendly people, year-round spring-like weather, proximity to the U.S., natural beauty, lack of a military and peaceful traditions, opportunities for   to start a business at that time, vibrant culture and unique  lifestyle all combined to make it an overwhelming choice for my new home. I have never regretted my decision for an instant and feel extremely fortunate for having fulfilled my dream of living in what I feel is the best country on earth. Incidentally, I have a very wealthy Canadian friend whose hobby is travel. At one time or another he has visited every country in the world. I asked him, “What is the best country you have visited?, ”  to which he quicky replied, “Costa Rica.”  He then asked, “Why do you think I live here?”   © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/11/14/multitasking-garden-setting-aquaponics-home",
        "date": "November 14, 2021",
        "title": "A Multitasking Costa Rica Garden: Setting up Aquaponics at Home",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER If you are looking for more than lettuce greens and tomatoes from your home food garden, this may well be the solution: Over the past decade or so, inventive gardeners have come up with a marriage of horticulture and fish farming.  Through aquaponics, or aquaculture, a gardener raises edible fish as part of a hydroponics system that grows vegetables and herbs without soil. Per square foot, aquaponics can be one of the most productive forms of agriculture, and is a perfect example of a a self-sufficient assembly of plants and animals that functions like an ecosystem, producing food for people without creating waste products or pollution. The water from the fish tanks can be used by the plants as a soluble fertilizer, while the plants filter the water for the fish. There are dozens of different kinds of fish that can be used for small or large scale production.  An aquaponics system that is functioning well can produce veggies every three months and a generation of fish in 9 months to a year. Costa Rica’s tropical climate also favors production all year round, and varieties of fish such as tilapia and guapote are available here in the country. As in hydroponics, there is a tremendous savings in water use, since water is recycled again and again. First off, find the right place for your garden. Poor lighting will result in poor growth of the plants, so it’s very important that the site receive good morning sun. The site should receive 6-8 hours of sun daily.  This usually means the eastern and southern exposures of the home. One negative aspect of aquaponic systems is that they tend to cost a lot to get started, but you can save money by using recycled plastic contains for growing beds and fish tanks. Hydroponic systems also need careful attention to the quality of water for the fish. So let’s look at some of the different types of do-it-yourself aquaponics systems that gardeners can choose from for the home. There are plenty of tutorial videos and instructions online to help you set up your own aquaponic system.  Here are a few examples: A mini-garden container and aquarium setup is a nice way to start and a great project for the kids. Hook up the tray or container for lettuce or a tomato with a growing media, then connect to the aquarium with a small pump. This simple system helps the family learn how to manage the water quality for the fish. Remember to place the growing unit in a sunny area. See Aquaponics Journal. Vertical wall growing containers and a plastic barrel fish tank In small areas it’s not top hard to attach containers to a sunny wall and connect them to the fish tank via irrigation tubing and a small pump. Once again, you can save by using  filled with the appropriate growing media. Plastic barrel fish tanks and growing beds.  These days it’s easy to acquire these reused barrels at Costa Rican   or barrel depots found in every town.  These blue barrels can be cut in half length-wise to make two garden growing beds and another barrel to raise the fish in. This system is less expensive and works in small areas. PVC pipes connect the growing beds with the fish tank and a pump circulates the water. Greenhouse hydroponics with larger fish tanks for continued food production. As you can imagine, the more fish you want to propagate, the more growing beds you will need to filter the water. In theory, a well-tuned aquaponic system can support one pound of fish per gallon of water.  When starting out, however, it’s better to plan on stocking one fish for every 10 gallons of water to make sure the system doesn’t fall out of balance and the fish will have more room to swim.  Open water systems need screening to prevent mosquitoes from breeding in the system, like   which can carry dengue, chikungunya, and Zika viruses. Finally, there are several enterprises in Costa Rica that offer complete construction and maintenance of aquaponic systems. For example, in our hometown of San Isidro del General, local school Escuela del Valle has just received a donation of an aquaponic system that will act as a living laboratory for the students. Jim Gale of Permacube Revolution is putting the final touches on the project which includes aquaponics and more. It’s good to see that these types of educational programs are being started across the country to help our youth to become highly skilled in the art of home and community food production. When we can save money, eat healthier food, and help improve our environment, it’s a good step toward redesigning the habitats we live in. Here’s a directory of aquaponics supplies and services. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/11/23/tico-talk-for-expats-and-tourists-part-1",
        "date": "November 23, 2021",
        "title": "Learning Spanish In Costa Rica for Expats and Tourists",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER You can’t call yourself fluent in Costa Rican Spanish unless you understand its slang. as they are known, play an important role in most daily conversations. Despite having been a Spanish teacher for many years with a Masters Degree, I quickly found myself overwhelmed by Costa Rican slang when I moved here in 1980. I began an exhaustive study of the local lingo and compiled thousand of   or   (expressions) in the process. Learning these phrases will help you navigate Costa Rica’s linguistic jungle, especially if you plan to live here. I am going to start this series with some of the more commonly used terms. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/12/09/how-to-drivers-licenses-in-costa-rica",
        "date": "December 9, 2021",
        "title": "How to: Driver’s Licenses in Costa Rica",
        "content": "As part of the measures to combat the coronavirus pandemic, you   make an appointment.  .  as pointed out one our readers Dr. Morgan:  “if you are WAITING for your residency (i.e., have EXPEDIENTE papers), you still need to renew your entry permit every 90 days because using your foreign driver’s license is BASED ON the last entry stamp in your passport (regardless of how long your residency application takes). This is crazy, but many people don’t realize it until it is too late and they are caught driving without a “valid” extension to their foreign license.”"
    }
]