[
    {
        "url": "https://ticotimes.net/2023/11/03/costa-rica-wildlife-meet-the-collared-forest-falcon",
        "date": "November 3, 2023",
        "title": "Costa Rica Wildlife – Meet the Collared Forest-Falcon",
        "content": "Today we meet the collared forest-falcon. It’s a pretty bird of prey that likes to eat iguanas and pose for my camera traps. The collared forest-falcon (Micrastur semitorquatus) is known as the   in Spanish, which is a pretty direct translation. Many birds and mammals have   is their Spanish name which generally means of the mountain, of the forest or wild. One time, a Tico friend was explaining the work I do to another Tico guy who was suspect of my ability to spend the entire day in the forest, and he assured him that I was ‘de monte’ and when I overheard it, I could feel a little swell of pride in my chest. In my head, collared forest-falcons are categorized as ‘common uncommon birds of prey.’ Costa Rica is home to many species of hawks, kites, falcons, and eagles. Many of which I have never seen and probably will never see. Others, like the roadside hawk,  , and gray hawk are so common that I can spot all three during the car ride from my house to the grocery store. Collared forest-falcons are somewhere in between. I see and hear them frequently enough that it’s not an ‘Oh my gosh!’ situation, but their presence is always a little more appreciated than the birds that I see on a daily basis. Collared forest-falcons live in a range over much of Costa Rica. They can be found along both coasts and most low laying areas but are absent from the high elevations of the center of the country. As their name points out, they’re usually found in the forest. They hunt in a range of forests from areas with big mature trees to scrubby secondary growth forests. When on the hunt, they perch in the lower levels of the forest, keeping a sharp eye out for their prey. They eat a range of small animals including large lizards, rodents, birds, and even invertebrates flushed out of the forest floor evading army ants. They either spot their prey and pounce down on it before it knows what’s happening or actively chase after it, showing off their speed and agility. I’ve recorded collared forest-falcons on the hunt several times. A few times I’ve recorded them pouncing on  , subduing them with a few bites to the back of the neck, and flying off. Once I recorded one confronting an   at a water source, but the agouti didn’t run away and didn’t look particularly frightened, so I figured they were probably too big to eat. Then, a few years later I recorded a collared forest-falcon very much attempting to ambush an agouti from above (it just missed), so they seem to be on the menu after all. Though they aren’t terribly common, I end up recording more collared forest-falcon videos than I would typically expect. In researching this article, I think I’ve realized why. The low level, mostly horizontal tree limbs without a lot of small branches and leaves in the way are the perfect place for them to perch and search for prey.  Those same tree limbs are low enough that I can climb up there and not die, and they lack the small branches and leaves that would continuously trigger my camera. So, it turns out, we like the same branches. So, click on the video below and meet the ‘common uncommon’ collared forest-falcon. Vincent Losasso, founder of  , is a biologist who works with camera traps throughout Costa Rica. Learn more about his projects on   or  . You can also email him at: "
    },
    {
        "url": "https://ticotimes.net/2022/12/26/costa-rican-traditions-for-new-years-eve",
        "date": "December 26, 2022",
        "title": "Costa Rican Traditions for New Year’s Eve",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Dancing, food, and the final countdown are part of the major traditions in Costa Rica to bid farewell to the Old Year and celebrate the arrival of the new one. Los Ticos celebrate in different ways, but the most important thing in this festivity is to be among family and friends. Years ago, the tradition was to gather around the table and enjoy a traditional Costa Rican dinner, according to anthropologist Dayana Morales of the Center for Research and Conservation of Cultural Heritage (CICPC). “Until recently, it was customary to tune the radio to one of the stations and wait for the final countdown. Then, at midnight, everyone would hug, kiss, celebrate, and wish each other the best for the upcoming year. At the table, it was common to see  , dishes prepared and preserved from the Christmas festivities, and liquor that enlivened the night,” said Morales. Some families keep alive inherited customs, such as Misa de Gallo (Midnight Mass) and collecting the flowers of Santa Lucia. These flowers are collected on the first day of the year and placed in the wallet or purse so that money is abundant throughout the upcoming year. On December 25, the   started. Many Ticos who live in the Greater Metropolitan Area visit it yearly, as they can find games, contests, food, and some of Costa Rica’s best bullfighters. Recently, the ‘chicharronada’ (preparing pork rinds in a space in the house) and ‘carne asada’ (BBQ) have become popular. The so-called “gallitos” (different foods wrapped in a tortilla), generally accompanied by ground beans, cabbage, pico de gallo, and escabeche, are also a must. The celebrations also include fireworks, which are nowadays a big part of New Year’s Eve celebrations. For Ticos, it is essential to share with friends and family, laugh, dance, enjoy delicious dishes and give thanks for the year that has ended and for what this new year will bring. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2022/12/27/costa-rica-proudly-shows-off-its-horses-at-el-tope-parade",
        "date": "December 27, 2022",
        "title": "Costa Rica Proudly Shows Off its Horses at El Tope Parade",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Cowboy hats and boots, in the purest “wild west” style, flooded the streets of downtown San José on Monday to proudly show off Costa Rica’s horse culture. Hundreds of animals and their riders paraded in ‘El Tope’ to commemorate, after three years without showing off due to the coronavirus pandemic, the National Day of the Horseman. For Omar González, horses are his life. A veterinarian specializing in equines for three decades, at 58 years of age he was designated as the “dedicatee” of the 2022 parade, the person to whom the parade is dedicated each year. “The horse for Costa Rica is one of the emblems of the people and going out to show off the horse on the day of the national El Tope is a conviviality with friends, it’s going to have a good time in a healthy way,” said Gonzalez. He has spent his whole life dedicated to raising and healing horses, and has participated in ‘ ‘ since he was a child. Gonzalez has been waiting three years to be able to get back on the back of his horse to parade: “It’s a national celebration,” he says. Since 2019 the horses had not paraded through the streets of downtown San José again. With the return of the horseshoes hitting the asphalt Costa Ricans took to the streets by the thousands to see the equines. ‘El Tope’ commemorates Costa Rica’s equestrian tradition since colonial times, when horses were necessary to move around the country or work in the fields. From that time comes the figure of the ‘ ‘, a Tico-style cowboy, now embodied by the hundreds of riders who join the parade every year. Marianela Matamoros, 58 years old, waits behind the fences that delimit the route to see the horses go by.  Some riders approach the crowd on the sides so they can pet the animals. Others ride different gaits of the horse, most of them at a walk, or doing paso doble, showing as if the equine were dancing. “In Costa Rica there are many horses and (‘ ‘) is something that the Ticos look forward to because here they come to show off their animals, they come to show what they have of beauty and enjoy, which is the most important thing,” says Matamoros. The horses were shown with their hairdos and braided manes and tails, shiny saddles and ribbons adorning their hair. The riders, some in traditional costumes and virtually all in assorted boots and hats. Before showing off their finery, the hundreds of animals to be paraded must undergo a veterinary checkup. Teams from the National Animal Health Service (Senasa) together with groups of veterinarians check each of the horses as soon as they get off the trucks that transport them, even before they are saddled. Diana Jiménez, 35, is the regent in charge of the veterinary teams and assures that they make sure that the animals “are well prepared, that they have adequate shoes, that they have an adequate body condition, that they have no wounds or signs of diseases that could pose a risk to other participants”. In addition, the veterinary teams supervise during the ride that no animal suffers, either by accident or by misbehavior of its rider. “The use of spurs is inappropriate, (also) the abusive use of the whip or correction. Riders in a state of drunkenness are not allowed to participate either,” Jiménez told AFP. In case of observing any malpractice, they have the power to remove the animal from the parade, sanction the rider or even confiscate the horse. Despite the veterinary controls, the control and the guarantees given by the organizers on the 4 kilometers of the route, activists rejected the parade.  A dozen people demonstrated with banners that read: “It’s no fun for the horses. ‘El Tope’ is animal exploitation” or “Your fun, their torture”. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2022/12/31/try-a-little-costa-rican-magic-for-a-lucky-2020",
        "date": "December 31, 2022",
        "title": "Was 2022 a Bad Year? Try a little Costa Rican Magic for a Lucky 2023",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER As you cut them, recite with devotion:  © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2022/12/31/costa-rica-bullfighting-toros-a-la-tica",
        "date": "December 31, 2022",
        "title": "Costa Rica Bullfighting: “Toros a la Tica”",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER A bull comes out of the pens, charges and throws improvised bullfighters through the air to win the public’s ovation. A twist that in Costa Rica turns bullfighting upside down. No matadors, no picadors, no banderilleros. In these New Year’s Eve bullfighting festivities, the animal is not touched and is applauded for catching the adventurous who hope to cut it down in the arena of the “redondel” (bullring) of Zapote, a neighborhood in the east of San José, with a capacity for 3,000 spectators. “Unlike bullfighting, in which the animal is harmed, here the animal is not harmed. It’s a bit more like the Roman circus,” says Alvaro Lopez, 42, the event’s producer. People enjoy, comment and laugh while a Zaino Miura bull (noted for its bravery) weighing some 450 kilos kicks an improvised bullfighter on the ground after he slipped while performing a “remove”. “It’s a bull, which is an animal that you can’t control, that can gore you, that can hit you, but still people like that, that’s what they like, what pleases them. In this show here in Costa Rica they say ‘if no one was rolled by the bull, the show was bad’,” says Lopez.  celebrates the opposite of traditional Spanish bullfighting, where a bullfighter is acclaimed for fighting a bull. In Costa Rica, people are unfamiliar with the improvised bullfighters but know the names and exploits of the animals in previous festejos, as the bull is not killed and can participate again 30 days later in other bullrings, according to the law. The regulation prohibits “killing the bull” and the animals are inspected before, during and after the bullfights by members of the veterinary service of the Ministry of Agriculture and Livestock.  “These bulls that come here are like athletes,” says López. Cattle rancher Luis Collado says that his bulls “play” in the bullrings once a month because “the animal is cared for and protected”. But for Juan Carlos Peralta, president of the Asociación para el Bienestar y Amparo Animal, the festejo also generates “suffering” in the bulls. “There is no longer any excuse to say that it is tradition. They are simply profiteers who, in order to profit from animal suffering, continue with this type of activity,” says Peralta. In front of the animal’s horns, several dozens of improvised bullfighters provoke the onslaught with shouts and fuss. They do not wear a bullfighter’s costume, they barely have a cape and their objective is clear: to run so as not to be gored. It is essential to wear “comfortable shoes like tennis shoes or soccer cleats,” says Maynor Jiménez, a 37-year-old construction worker who becomes a bullfighter when he puts on his Mexican wrestler’s mask. Nine years ago he had a “lenvantín” and a bull gored him so many times that he had to spend nine days in the hospital. “A ‘levantín’ is when the bull goes after a person and picks him up and pulls him up, falls and picks him up again and rolls him around in the arena,” Jiménez explains in the alley waiting for the fourth of the afternoon. Next to him William Portugués, a 54-year-old security systems installer, prepares himself along with the rest of the improvised  . “It’s very dangerous, at any moment a bull can gore you, it can kill you,” he warns before the animal’s imminent entry into the ring. “The worst thing is to have lost many companions who have died here or in the hospital through a nasty goring,” recalls Portugués after listing broken bones in various parts of his body after encounters with the bulls. Every day from December 25 until January 8 there are two bullfights per day and 20 to 30 improvised bullfighters enter the ring with the intention of trimming the 10 to 12 bulls in each festejo. Admission costs about 25 dollars. The tradition dates back to colonial times and in 2022 it returns after three years suspended due to the coronavirus pandemic.  The return of the “ ” marks the arrival of Christmas and New Year and according to a 2015 University of Costa Rica survey 62.7% acknowledge that they “like” these festivities. 50.2% say they have ever been to the bullring and 94.5% have seen it on television. The bullfights are broadcast live simultaneously on several channels as if they were soccer matches. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/01/01/costa-rica-develops-basketball-for-good-project",
        "date": "January 1, 2023",
        "title": "Costa Rica Develops Basketball for Good Project",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Basketball For Good is a program that involves 3×3 basketball and mini basketball to foment equality, hand in hand with sports activities. It’s carried out through FIBA Foundation and its Youth Leadership Program. For the past four years, the Foundation has brought together young leaders from National Federations in the Americas, Africa, Southeast Asia, and the Pacific, providing them with leadership and management skills to help them develop projects in their countries. Additionally, they’re able to address social problems in their communities, such as inactive lifestyles, violence, and lack of access to education, to develop more opportunities and equality in sporting activity. Meilyn Herrera, current national team player and basketball coach graduated from the Youth Leaders of the Americas Program and participated in this year’s seminar in El Salvador. As a youth leader in her country, she works to promote the 3×3 and mini-basketball movement within the Costa Rican Basketball Federation (FECOBA). In one year, she co-founded a 3×3 basketball academy in the country’s capital, San José, while strengthening education, health, and wellness initiatives. “I fell in love with 3×3 basketball in 2018; the modality means so much to me. It caught my attention, and I got involved early on,” said Meilyn. She said that the Youth Leadership program has taught her how to implement a social project linked to sports and has given her the tools to develop her project and create an academy. “We learned, through the Leadership Workshop, that sport is related to sustainable development and that we can contribute to education,” she explained. The Costa Rican learned about the program through FECOBA and quickly became interested because it intertwined environmental and social issues, basketball, and everything related to her chosen career. In July 2022, Meilyn, along with Daniel Rodriguez, also a youth leader from Costa Rica, and the San Jose Sports and Recreation Committee, began developing a 3×3 basketball academy for at-risk boys and girls between the ages of 5 and 11. “We were able to reach an agreement with one of the most important cantonal committees in the country. They have a sports literacy program, where kids are involved with a sports process from age 5 to 11, and it was there that we were able to include 3×3 basketball as part of the project,” they remarked. The FIBA Foundation oversees addressing the role of sport and basketball in society by preserving and promoting the values of basketball and its cultural heritage. The Foundation believes that basketball has the potential to empower, educate and inspire young people and facilitates this through the implementation of Basketball for Good Projects around the world. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/01/10/costa-ricas-ukrainian-community-helps-orphanage-with-benefit-concert",
        "date": "January 10, 2023",
        "title": "Costa Rica’s Ukrainian Community Helps Orphanage with Benefit Concert",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Last November 5 a benefit concert for Ukraine took place in Calgary, Alberta and communities from several countries including Costa Rica, Poland and Japan rallied to the cause by purchasing tickets on Eventbrite and watching the live stream on Youtube.  St. David’s United Church hosted the concert which featured an all star lineup of Ukrainian musical talent including the legendary Ihor Bohdan, and raised $14,677 Canadian ( $11,000 USD). An important organizational assist for the concert came from Costa Rica’s Ukrainian community. The Tico Ukrainians promoted the concert through ticket purchases, organizing watch parties and contributing a colorfully inspiring greeting video which was screened at the concert. The first project delivered using the benefit concert proceeds was the purchase of a 14-kilowatt diesel generator for the Lviv State Orphanage which houses 178 kids.  The logistics involved in the purchase and delivery of the generator were administered by Dennis Scraba and Canadian NGO Amigo Relief Missions.  The NGO operates with volunteers, allowing all funds from the benefit concert to be spent directly on projects. Dennis Scraba  commented: “We would like to thank everyone involved in the November 5 benefit concert for providing these needed funds as the orphanage was really struggling to keep the building heated.” One of the Costa Rica organizers, Liudmila Kikisch Martiniuk, is from Lviv. I asked her what the purchase of the generator means for the orphanage this winter. “When Putin and the Russians are bombing energy infrastructure critical to human survival it means LIFE, (heat, light, water, basic services, food, refrigeration, the possibility of all the important basic activities for human beings, as well as increased communication.  This in turn provides emotional solidarity that supports the ability to resist, survive and WIN. This contributes to the   of an indomitable and glorious people.” What follows is a short interview with Tetiana Khominch of the Ukrainian Association in Costa Rica. My name is Tetiana Khominich, I was born in Kiev, Ukraine but for the past  15 years I have been living between the USA and Costa Rica. I am one of the founding members of the first Ukrainian Association in Central America called Cultural Diplomacy Ukrainians in Costa Rica. I would say between 300 to 400 people from different regions of Ukraine. Interesting fact, that despite living in Costa Rica for many years, we all met and got to know each other only last year after Russia’s unprecedented attack on Ukraine in February 2022. It was a year of great sadness for us, but also solidarity and compassion. As you can tell from the name of our non profit association “Cultural Diplomacy”, our main purpose is to promote and bring about awareness of the history, culture, traditions and arts of Ukraine, as well as finding ways to help our far away homeland through collecting donations. All donations go to orphans in Ukraine.   I am proud to say that we organized a very successful Ukrainian Independence Day in Museo Calderon Guardia, then we held the First Ukrainian Film Festival in San Jose, as well as a night of Ukrainian Arts in Barrio Amon.  There are more interesting events planned, please stay tuned. We were very honored to contribute to such a beautiful concert of our colleagues in Calgary, Canada. We purchased tickets as a group, and some of us gathered and watched the show together. It was a great cause to help our country, and we are proud to be a part of it! © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/01/28/costa-rican-museums-to-visit-in-2023",
        "date": "January 28, 2023",
        "title": "Costa Rican Museums to visit in 2023",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER The Costa Rican Tourism Institute (ICT) created a Museum Guide for tourists visiting these centers. The 48-page-long document features the main information and includes an English translation.   “Costa Rica has an important network of museums dedicated to collecting, guarding, displaying cultural heritage and trying to disseminate our values,” stated the ICT.  Located in the heart of the Caribbean, this Museum showcases the history behind the cacao fruit and the machinery used to process and dry cocoa in the last century and observes the whole process the fruit undergoes to turn into one of the most delicious and loved products.  Customers can taste beans throughout their different stages, and then, once the process is finished, they can savor several types of chocolate.  “The magnificent natural environment of CACAO TRAILS TAYKU allows for all kinds of activities, including walking amidst unique tropical botanical collections, bird watching from the forest of the private reserve that Cacao Trails Tayku offers while enjoying interactive contact with the local cocoa culture,” the Museum specified.  The Museum is located in Buenos Aires de Puntarenas and preserves the cultural and natural heritage of the Boruca Indigenous Community.  It highlights the ancestral techniques of manufacturing and handicraft weaving. The opening of the  Museum had the help of the National Museum and the Museums of the Central Bank, who supported the Indigenous community in different ways. The Museum has a souvenir store with handicrafts made by the indigenous people of the Boruca area. It’s also worth highlighting that the museum building is an example of the ranch used in ancient times.  Punta Islita’s Outdoor Contemporary Art Museum opened its doors in 2003. This Museum has a social concept of art and creative thinking as a generator of sustainable development. The Museum was founded as an initiative of Hotel Punta Islita, committed to a tourism development model in harmony with the community’s growth. Art was identified as the ideal tool to support the community because of its potential, versatility, and available resources. To view the complete list of museums, visit: https://www.ict.go.cr/es/documentos-institucionales/brochures-1/brochures-para-el-turista/2161-05-museos/file.html?fbclid=IwAR1MWss82Gx1THkiOTQI8cIPKalLX38KV_EyzVVOarN-oCfFkmZL04AEdAM.  © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/01/31/u-s-citizen-arrested-in-costa-rica-with-pre-columbian-artifacts-in-his-luggage",
        "date": "January 31, 2023",
        "title": "U.S. citizen arrested in Costa Rica with pre-Columbian artifacts in his luggage",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Costa Rican airport authorities detained on Monday a U.S. citizen who was trying to fly with seven pre-Columbian pieces of about 1,200 years old hidden in his luggage. The 56-year-old man was approached by the Airport Police of the Air Surveillance Service at Juan Santamaria International Airport, in San Jose, and they discovered the pieces when they checked his luggage. “The National Museum was consulted, whose experts indicated that the vessels correspond to the Central Archaeological Region and a temporality from 300 to 800 A.D., a phase known as La Selva,” said a statement from the Ministry of Public Security. The man, who the authorities only identified by his last name, Ficalora, was flying to the United States and was in the country as a tourist, was arrested for violation of the law of the Archaeological Heritage of Costa Rica. This type of ceramics, or fragments of them, are vestiges found in Costa Rica, some up to 4,000 years old.  According to the National Museum, ceramics are the most abundant material in archaeological deposits. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/02/05/bad-bunny-and-anitta-add-latin-touch-to-the-grammys",
        "date": "February 5, 2023",
        "title": "Bad Bunny and Anitta add Latin touch to the Grammys",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER The 65th Annual Grammy Awards this Sunday could become the scene of another historic moment for Latin music with Bad Bunny and Anitta, two of its top performers, vying for two of the night’s most coveted categories. The U.S. Recording Academy Awards ceremony, hosted once again by comedian Trevor Noah, will be held at the Crypto.com arena in Los Angeles from 17H00 local time (01H00 GMT Monday). Puerto Rico’s Benito Antonio Martinez Ocasio, Bad Bunny to the world, who already has two gramophones to his credit, is aiming for his hit “Un verano sin ti” to win the coveted Grammy for Album of the Year, a recognition never before awarded to an album recorded entirely in Spanish. The album, with more than 4 billion plays on Spotify, has garnered record upon record, as has his promotional tour, which filled stadiums in Latin America and the United States. But the competition for the reggaetonero is not minor: titans such as Adele, Kendrick Lamar and the great favorite, Beyoncé, are competing for the coveted award. Bad Bunny’s triumph “would mean a lot for Spanish-speaking people and for our culture because it really says ‘look, Spanish music is as respected as English music, and there really are no barriers in music,” Colombian Sebastian Yatra told AFP. On the other hand, Brazil’s Anitta, who last year had the whole world swaying its hips with her unstoppable “Envolver”, is making her first Grammy nomination, in which she seeks to impose herself as a new artist. The last time a Brazilian was nominated for Best New Artist was almost 60 years ago, when Astrud Gilberto immortalized the classic “Garota de Ipanema”. But she lost to the Beatles, a gramophone that Anitta now hopes to take home. The Carioca, in competition with, among others, the Italians Maneskin and the singer son of Mexican immigrants Omar Apollo, could become the first Latin American to triumph in this category. Despite having more than 10 years of career, the nomination comes when Anitta is making her way in the international market, something she has defined as a new beginning. “As a Brazilian and a Latina, a nomination like this means a lot to me, and fills me with pride,” said the “Girl from Rio” in an interview with AFP. In the categories dedicated to Latin music, the specialists give as favorite the Spanish Rosalía with her “Motomami”, which shone at the Latin Grammy last year, to take the award for best Latin rock or alternative music album. Carlos Vives, Maluma, Jorge Drexler and Cristina Aguilera are also in the running for Latin music gramophones, as is Daddy Yankee, famous for globalizing reggaeton, but who has not won a Grammy in more than two decades of career. All eyes tonight will be on Beyoncé, with expectations of whether her energetic, danceable “Renaissance” will take home the night’s top gramophones. The 41-year-old leads the field with nine nominations, while Britain’s Adele is up for seven gramophones with her introspective “30”. The tacit duel has prompted comparisons to the 2017 edition, when Adele swept the top awards at the music industry gala, knocking out Queen Bey’s “Lemonade.” But Beyoncé continues to make history. The woman with the most gramophones (28), she could this Sunday become the most awarded artist in Grammy history, a title held by classical music conductor Georg Solti (31). Despite her conquests, Beyoncé is seen as the contender and not the favorite when it comes to the main categories: best album, best recording and best song. Of these awards, she only won best song once, in 2008, with “Single Ladies”. But specialists warn that this will finally be her night and that she will win the Grammy for Album of the Year.”I hope so beca use doesn’t she deserve it?” said Nile Rodgers, co-founder of the band Chic, who contributed to “Renaissance,”. “She is without a doubt the most culturally important artist in the world,” said Merck Mercuriadis, Beyoncé’s former manager at the gala before the awards. Other contemporary musicians such as Kendrick Lamar, Harry Styles, Brandi Carlile and Taylor Swift are also in with a good chance of winning the main awards, having accumulated a large number of nominations. Rodgers, Supremes, Nirvana, among other artists, will also receive the Lifetime Achievement Award on Sunday. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/08/20/ancient-artifacts-exhibited-for-guayabo-monument-anniversary",
        "date": "August 20, 2023",
        "title": "Ancient Artifacts Exhibited for Guayabo Monument Anniversary",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER The Omar Salazar Obando Museum in Turrialba has opened a new exhibition titled “Guayabo: The Journey of Our People” showcasing 60 pre-Columbian artifacts from Guayabo and Turrialba. The exhibition commemorates the 50th anniversary of Guayabo National Monument’s establishment as a preserved archaeological site. Many of the artifacts on display are making their public debut in Turrialba through this collaborative effort between the Atlantic Headquarters, the School of Anthropology at the University of Costa Rica (UCR), and the National Museum. The pieces span a timeline from the early 19th century to present day. Ifigenia Quintanilla Jiménez, director of the National Museum, emphasized the importance of this exhibition in honoring the ancient cultures that inhabited Guayabo and the greater Turrialba valley long ago. Visitors can expect to see diverse artifacts, ranging from larger items like tables and tombstones to smaller objects related to food preparation and consumption. The exhibition will remain open free to the public until August 24, 2024. It operates Monday through Friday from 8:30am to noon and 1pm to 4:30pm. Historically, archaeologists believed pre-Columbian people in Costa Rica’s Central Valley subsisted mainly on maize like Mesoamerican groups. However, new evidence suggests their diet was more varied. Excavations by UCR archaeologists at Guayabo under the National Museum’s supervision uncovered remains of legumes, likely beans, and even fish bones. Researchers propose the fish originated from today’s Caribbean coast, transported inland for consumption. This discovery sheds light on previously unknown cultural exchanges and trade routes. Marking its 50th year as a protected site,   has been vital in unearthing new archaeological insights. It spans 20 hectares in the Turrialba district of Santa Teresita. Although inhabited from 1000 BC to 1400 AD, Guayabo flourished between 900-1100 AD when most existing infrastructure was built. The new exhibition honors this rich cultural history. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/11/02/costa-ricas-vargas-golden-again-in-hurdles-at-2023-pan-american-games",
        "date": "November 2, 2023",
        "title": "Costa Rica’s Vargas Golden Again in Hurdles at 2023 Pan American Games",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Costa Rican track star Andrea Carolina Vargas cemented her status as one of the region’s top hurdlers by successfully defending her title in the women’s 100-meter hurdles at the 2023 Pan American Games in Santiago, Chile this week. On a wet track at the National Stadium, Vargas pushed through rainy conditions to claim gold with a time of 13.06 seconds. She edged out Cuban rival Greisys Lázara Roble by just 0.03 seconds in a thrilling finish. American Alaysha Johnson took bronze 0.13 seconds behind Vargas. This marks the second straight Pan American gold for the 27-year-old Vargas, who was also champion at the  . She becomes the first Costa Rican athlete to win two consecutive gold medals in the same event at the prestigious competition. “This is an incredibly special moment for me and for my country,” said an emotional Vargas after the race. “To be able to achieve this again, under difficult conditions, fills me with so much pride.” Vargas has been in peak form this season, taking gold at the Ibero-American Championships in May followed by another victory at the   in June. She also holds the Central American and Caribbean record in the 100m hurdles event. But defending her Pan Am title posed a new challenge that Vargas was determined to overcome. “My goal was to go out strong from the first hurdle and maintain my speed throughout,” she said. “I am so grateful I was able to accomplish that.” Vargas’ repeat gold opens the athletics medal count for Costa Rica in impressive fashion. She has shown her world-class talent once again on the international stage. Vargas is an inspiration and role model for youth across the country. “This is for Costa Rica!” declared Vargas as she waved the national flag proudly after her win. With athletes like Vargas leading the way, the future looks bright for Costa Rican athletics. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/10/31/halloween-originates-from-celtic-traditions",
        "date": "October 31, 2023",
        "title": "Halloween’s Origins in Celtic and Christian Traditions",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER In the United States, Halloween has boomed into the second-largest commercial holiday, generating billions in sales annually. While many Costa Ricans have adopted this tradition, others reject it as an unpatriotic or even anti-Catholic tradition. However, the roots of this controversial holiday are neither North American, nor far removed from the scope of Christianity. Halloween was born from the Celts, who populated what is now the United Kingdom, Ireland and northern France more than 2,000 years ago. On the Celtic calendar, Nov. 1marked the beginning of the new year and the winter season. The Celts celebrated their new year on Oct. 31 with a festivity known as Samhuinn or Samhain (pronounced sow-in), meaning “summer’s end.”  Their harsh winters often brought prolonged darkness, hunger and death, conditions which the Celts attributed to spirits from the world of the dead and the unborn that visited the earth on the night of Oct.31.The Celts believed on this night, the veil between this and the otherworld became thin enough to allow Celtic priests, known as Druids, to engage in the art of divination.  On this night, Druids built giant bonfires, around which the Celts gathered to tell their fortunes, wearing animal heads and skins, their versions of our modern-day Halloween costumes. During the 800s, after the Romans had conquered and brought Christianity to Celtic lands, Pope Boniface IV proclaimed Nov. 1 All Saints’ Day, in what many people believe was an attempt to substitute the Samhain festival with a church holiday in honor of saints and martyrs.  The word “Halloween” derives from the middle-English Alholowmesse, meaning All Saints’ Day, which was also referred to as All-hallows or All-hallow mas. Oct. 31 started being called All-hallows Eve and finally, Halloween. Trick-or-treating came along after the church appointed Nov. 2 All Souls’ Day, or the Day of the Dead.  During early All Souls’ Day celebrations in England, poor people begged for food and families would hand them “soul cakes” in exchange for prayers for their deceased relatives.  The church promoted this practice to eliminate the tradition of leaving wine and food to appease wandering spirits. The practice of dressing in costumes evolved from the Samhain festivity. People were afraid to run into spirits who visited the earth on the night of Oct. 31.  They disguised themselves in masks and costumes so spirits would confuse them for other ghosts and not identify them as humans. Halloween’s origins are deeply rooted in  s and have evolved over time to incorporate elements of Christian and secular celebrations. While it may be seen as a controversial holiday in some circles, its rich history and cultural significance cannot be denied. As we continue to celebrate Halloween, it is important to remember its roots and the many ways in which it has been shaped by different cultures and beliefs. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/11/01/costa-rican-cocoa-selected-among-worlds-best",
        "date": "November 1, 2023",
        "title": "Costa Rican Cocoa Selected Among World’s Best",
        "content": "The distinguished Costa Rican cocoa producer, Chocolatera del Volcán, has earned international acclaim by being selected among the top 50 cocoa samples globally in the prestigious “ ” contest. Chocolatera del Volcán’s sample was chosen along with three other Costa Rican offerings to represent the country following a competitive national selection process of over 25 entries in January. This tremendous honor provides valuable recognition of Costa Rica’s emergence as a producer of supreme quality fine cocoa on the world stage. The Vice Minister of Agriculture and Livestock, Fernando Vargas Perez, highlighted the strategic importance of this international distinction for   sector. “This contest represents a strategic opportunity for trend analysis, process standardization, quality improvement, and the global positioning of Costa Rican cocoa in specialized market niches,” he remarked. Vargas Perez added, “In Costa Rica, producers have been diligently preparing and effectively managing the post-harvest phase, promoting quality and a rich diversity of flavors, which has culminated in international recognition as a producer of fine cocoa. This accolade is a testament to our collective efforts.” The widely respected Cocoa of Excellence program featured 222 entries from 52 cocoa-producing nations this year. The competition aims to honor cocoa producers worldwide for their diligent efforts in cultivating quality cocoa during the growing, harvesting, and post-harvest processing phases. The initial evaluation consisted of a meticulous physical assessment of whole and cut cocoa beans by expert judges. This was followed by a thorough sensory analysis of the cocoa liquor which evaluated aroma, flavor, appearance and other attributes based on strict protocols. Costa Rica can take immense pride in   securing its place among the world’s top 50 – a truly monumental accomplishment. But the final chapter of this story remains unwritten. The celebrated samples will now be processed into darkened chocolate which will undergo another round of rigorous blind tastings by an esteemed panel of cocoa and chocolate experts in December 2023. Their sensory analyses will ultimately determine the recipients of the coveted Gold, Silver and Bronze Cacao of Excellence awards to be announced in February 2024. While the waiting game continues, Costa Rica has already emerged victorious by demonstrating to the global cocoa community the supreme caliber of its national produce. Chocolatera del Volcán’s inclusion in the elite top 50 serves as a personal triumph for their team. But even more significantly, it represents a collective milestone and global recognition of Costa Rica’s prominence as a producer of some of the finest cocoa in the world. With the judging finale fast approaching, the shining spotlight has firmly fixated on Costa Rica’s promising cacao sector. Come February, we will eagerly await the final results while taking immense pride in this phenomenal accomplishment of national distinction on the global stage."
    },
    {
        "url": "https://ticotimes.net/2021/09/26/is-costa-rica-dangerous-for-expat-retirees-putting-crime-into-the-proper-perspective",
        "date": "September 26, 2021",
        "title": "Is Costa Rica dangerous for expat retirees?— Putting crime into the proper perspective",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER I am repeatedly asked  by people thinking of relocating here if there is a lot of crime. I have lived in Costa Rica for over 40 years, speak Spanish with native fluency and above all want to want to clear up a lot of erroneous information that is being published on many social media platforms about the subject of expats and crime in Costa Rica. I’d like to point out that I ride the bus, walk the streets, talk to many Costa Ricans, so I am fortunate to be able to have the opportunity to observe daily life first hand. Crime is a difficult subject to address since it has a lot to do with perception and understanding the scope of the problem. Bear in mind that NO country in the world is crime free. If it exists, then please let me know.  I can honestly state that during the time I have lived here I have never been a victim of any crime. Yes, I have made a couple of bad investments and some of my ex-girlfriends have beaten me out of a few bucks, but nothing more than that. So putting everything into proper perspective, Costa Rica is not a dangerous country in which to live.  Yes, there have been cases where a few American tourists have disappeared without leaving a trace. Over the years a handful of expats have been murdered for their possessions or died under mysterious circumstances  According to my contacts at the American embassy, the real danger here is from drowning and not dying as a result of a violent crime.  Despite the warning signs on many  , tourists, Costa Ricans and residents venture into unfamiliar waters and drown every year because of the strong undercurrents. The good news is that the country is in the process of organizing a national   service to try and prevent more deaths Automobile and motorcycle accidents also cause a lot of unnecessary deaths but most of those who die are locals and not foreigners. It is important to make the distinction between “Latino (Costa Rican, Colombian, Nicaraguan, etc.)  on Latino crime” and “Latino on  ” crime in Costa Rica. The latter is miniscule while the former predominates.  The majority of homicides occur among Costa Ricans and people from neighboring countries.  They are usually precipitated by territorial drug wars, revenge, jealously, inebriation, crimes of passion or armed robberies. Expat residents are seldom victims of these types of crimes. Since Costa Rica is a small country when a crime does take place, it is usually sensationalized and blown completely out of proportion by the news-starved local and sometimes international media. For instance, a few weeks ago a North American  was shot to death by the ex-boyfriend of his local girlfriend. Unfortunately, a lot of single men get mixed up with prostitutes, gold diggers or lowlifes who seem to be the easiest women to meet. I have seen this scenario repeated over and over and over during the 40 plus years that I have lived here. I even have coined a term that can be applied in most cases, “  or dumb  .” Many leave their brains on the plane and do things that the never would do in their home countries that include bad investments and getting involved with unsavory characters. They fall in ’lust’ and not in love with the country and drop their guard. Costa Rica is peaceful when we compare it to Mexico which reportedly has around 1,000,000 residents from the United States. Over 250,000 people have died there due to drug violence during the last 15-20 years. In fact, 43  candidates for public office  have been killed so far this year by the ruthless cartels.  Nothing on this scale has EVER occurred in Costa Rica. Yes, we have local drug dealers who kill each other but on a small and far less violent scale than Mexico where murder, mayhem, dismemberment and other heinous crimes are almost an everyday occurrences.  Medellín Colombia which is slowly becoming a new   haven, has double the homicide rate of Costa Rica at about 25 deaths per 100,000 people. When Pablo Escobar was terrorizing the city’s inhabitants the murder rate was a whopping 450 deaths per 100,000.  The city is much safer now even with the current social upheaval. Curiously, a while back I was reading an article that almost every person including foreigners have metal security doors on their homes due to the large number of burglaries. This phenomenon doesn’t seem to be the norm here. According to the media,  in 2021 around 20 foreigners have been murdered in Medellín to date. Let’s not forget that the good old USA is one of the most violent countries in the world since guns are obtained easily. A resident or citizen of Costa Rica can only own three (3) handguns and NO military assault weapons. A handgun permit has to be renewed every two years and includes a thorough psychological exam and evaluation.  Furthermore, to date there have been NO indiscriminate massacres like the ones that are happening almost every week in the United States. Here you can go shopping or to a movie here without having to look over your shoulder for fear of a deranged gunman. I know of a few people who have been mugged over the years, usually in San José. On the other hand, I also have friends who have lived there for many years and never had a single problem nor felt in danger.  Generally it’s a good idea not to carry anything that can’t be easily replaced (passport, laptop, U.S. driver’s license, lots of cash, etc.). Mugging can be avoided, but you have to be smart about it, look like you know where you’re going, and don’t display targeted items like cell phones, digital cameras, or expensive jewelry. Burglary is the most prevalent crime here. Choosing where to live reduces the chance of burglary. Most condo and apartment complexes have good security. ADT and other alarm companies operate here.  I have had ADT for over 20 years without a problem. Their response time is quick even when my alarm is triggered accidently. Many neighborhoods also have night watchman who make the rounds.  Isolated properties that are off the grid are more vulnerable than gated or semi-gated communities or traditional neighborhoods with subdivisions.  Believe me! If thought it was dangerous for my family to live here, I would pack my bags and relocate. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/10/03/an-eco-friendly-medicinal-garden-secret-yellow-bells",
        "date": "October 3, 2021",
        "title": "An eco-friendly, medicinal garden secret in Costa Rica : Yellow Bells",
        "content": "Here’s a colorful, tropical, native ornamental for your garden that doesn’t require dangerous pesticides or chemical fertilizers, nor lots of irrigation in the dry season. It’s called Yellow Bells or Yellow Elder ( ). Costa Ricans call it   or little vanilla. This hardy bush is found in most regions of Costa Rica and easy to identify with its clusters of yellow, bell-shaped flowers and serrated, compound, pinnate leaves with 5 to 13 leaflets. This plant is a member of the family  , and is related to   (  and  ( ) which has similar flowers. Yellow Bell is a patio ornamental that can also be seen along many sidewalks and avenues. By the way, you can often collect seeds from these bushes’ narrow capsules, which somewhat resemble miniature  . The older capsules turn gray and split open, releasing the small brown seeds encased in a white paper sheath. These seeds can be planted in small pots or recycled plastic cups with holes in the bottom and filled with potting soil. In about a week, the seeds should germinate, and in a few months the young seedling plants can be transplanted to a permanent site around the home. Another form of propagation is to take woody stem cuttings from a bush and start them in containers in the greenhouse or plant them directly in the soil where you would like them to grow. The latter should be done in May or June, when the rains keep the soil continually moist. Yellow bells grow and flower best in full sun conditions and can tolerate salt breezes from the beach. They also grow in a wide variety of soils and require very little in terms of soil fertilization. Of course, additions of   and foliar fertilizers help to keep these bushes blooming and growing vigorously. It is common to find them planted as a shrubby, living fence or as a freestanding specimen on the patio. They can be pruned yearly to keep them compact and low, and this hardy native plant doesn’t require special pampering, nor does it suffer from any serious insect problems or plant diseases. And the secret? According to Hernán Rodriguez Navas in his book “  (“Uses of Medicinal Plants in Costa Rica”), the leaves and bark of yellow bells have been used by indigenous people for centuries to treat pain, fevers, and infections. Tea made from the inner bark is a tonic to aid in the treatment of diabetes, kidney aliments and rheumatism. Researchers have named the active ingredient tecomanine. So there you have it: A beautiful, ornamental and natural medicine right in your backyard with less work, better health and more natural harmony in your garden. This article first appeared in 2015"
    },
    {
        "url": "https://ticotimes.net/2021/10/09/30-reasons-why-you-should-not-move-to-costa-rica",
        "date": "October 9, 2021",
        "title": "30 reasons why you shouldn’t move to Costa Rica",
        "content": "Over the years, I have had the opportunity to observe firsthand thousands of foreigners who have relocated to Costa Rica. Many fulfill their of dream of living in paradise by adapting to the country’s culture and taking advantage of all it has to offer. I have heard people say, “I love Costa Rica so much, you could never drag me back to my home country.” Success stories abound here.  For many who move here, it is a chance to start over, develop new hobbies and interests, make friends, find adventure, live in a different culture or study a foreign language. However, things do not always out for some who relocate. According to the Association of Resident of Costa Rica (ARCR) and my sources in the moving business, about 40% of those who come here end up returning home for a variety reasons:  That said, there other reasons why some shouldn’t  in the first place to avoid failure and have to return home. Christopher Howard has been conducting relocation/retirement tours and writing retirement guidebooks for more than 30 years. For information about life in Costa Rica, relocation tours or to have your questions answered,   or contact Christopher Howard at:     call Toll Free 877-884-2502 and in Costa Rica 011-506-8849-0081"
    },
    {
        "url": "https://ticotimes.net/2021/10/10/4-things-you-need-to-know-before-investing-in-a-local-startup",
        "date": "October 10, 2021",
        "title": "4 Things to Know Before Investing in a Costa Rica Startup",
        "content": "Without a doubt, entrepreneurship in Costa Rica has been growing in the past few years, and there are many initiatives that have been contributing to it. From business plan competitions to prototyping events and from structured entrepreneurship training programs like  , to the emergence of dozens of incubators it would seem there’s never been a better time to take the leap and start your own business. Local startups today need many things besides funding, but it is this sole component that grabs most of their attention. They apply to incubators as a means to obtain seed capital from the Banking System for Development (  or gain access to angel investment; they flock in masses to business-plan competitions in hopes of winning the prize of a couple thousand dollars; or, if they are brave enough, they go through the ordeal of navigating the bureaucracy of local banks in order to get flexible loans or microcredits. If you are a potential angel investor, there are many opportunities worth exploring in order to fulfill some of this capital demand, as long as you take some considerations and precautions before embarking on your journey. Before you invest in a local startup, make sure you prepare to cope with these four perks – and quirks – of our entrepreneurial ecosystem: As a result of the lack of venture capital markets in Costa Rica and the fact that businesses here are rarely funded by third party investment (as opposed to savings, loans, and your uncle Francisco’s money), many entrepreneurs do not speak the same language as investors.  There is still a notion that frames investment as a “help” or something that they should get out of good will. The enthusiastic founder in front of you might not think to discuss risk against return, investment horizon and exit strategy, , so you might need to create a common ground on which to negotiate. From my experience, showing entrepreneurs how other startups abroad got their funding helps them understand the tradeoffs associated with bringing an investor on board. Although many entrepreneurs will tell you that money is all they need, make sure you assess the young company’s needs thoroughly before taking the checkbook out. The team might not have all the skills required to run the company, there might be lack of understanding of the market they are trying to serve, or they might be over-optimistic about their cash flows.  Either way, you might have to step in and invest your time, contacts and knowledge to make it take off. Although someone might argue that’s the job of investors everywhere, that type of active involvement might be even more needed in a country like Costa Rica. Even at very early stages of the project (sometimes as early as the idea stage), entrepreneurs will have high hopes for their company’s valuations when it comes to letting equity go. Perhaps more common locally than in other startup ecosystems, you might find what we could call the “emotional premium on equity,” or the excess in price that the owner expects you to pay to compensate for all those nights he worked so hard, the time away from his family, and the uniqueness of his idea.  The truth is that until proven out there in the market, ideas by themselves are rarely worth much, and surely 50% of a company is better than 100% of an idea, but since new entrepreneurs don’t always act (strictly) rationally, you might need to drive a hard bargain. On the bright side, venture capital is still in its infancy in Costa Rica, and although there are lots of people with money, there’s not a culture of investing in startups (most investors come from within families). Many local investors don’t understand the inherent risks and rewards of investing in startups and therefore ask for hefty conditions, such as outrageous percentages of equity that entrepreneurs rarely agree with. So if you keep your head cool and roll with the idiosyncrasies, you might strike yourself a good deal. Costa Rica might not be the Silicon Valley of Latin America (yet), but we’re moving ahead. There’s a very educated workforce that is now finding incentives and programs to help them innovate and turn their ideas into viable businesses. One piece of the puzzle that still seems to be unresolved is the investment, and that’s where many angel investors have an opportunity. Is it the right opportunity for you?"
    },
    {
        "url": "https://ticotimes.net/2021/10/23/16-reasons-why-you-should-move-to-costa-rica",
        "date": "October 23, 2021",
        "title": "16 Reasons Why You Should Move to Costa Rica",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER A few weeks ago I wrote an article about who  . I received a lot of interesting responses from my readers. So, I decided to write a complimentary article about reasons to relocate here. As most people know Costa Rica is a user-friendly country for Americans. For the last 30 years they have been flocking here because of the country’s stellar international reputation, welcoming  people, absence of an army and peaceful democratic tradition. Costa Rica has no enemies nor does it meddle in other country’s affairs. Other pluses that attract foreigners are: one of the best climates in the world, the   lifestyle (which means pure life in its essence and is the national motto), scores of activities to stay busy and happy, unparalleled natural beauty, paradisiacal warm-water beaches, and so much more. Given the above, it comes as no surprise that Costa Rica is tops on the retirement list of retirement havens and has more American residents per capita (proportionately) than any other country in the world. They cannot be wrong! Utopia does not exist but Costa Rica comes close for many expats who have successfully made their home here. I’d like to point out that Costa Rica is not for everyone as I alluded to in a   The best thing to do is to come test drive the country with an open mind, good attitude, sense of humor and explore. This may require several visits of a few weeks or months to find out if you are a candidate for long-term living. For more information about relocating to Costa Rica contact Christopher Howard at:  © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/10/30/expat-life-my-long-journey-to-costa-rica",
        "date": "October 30, 2021",
        "title": "Expat Life: My Long Journey to Costa Rica",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER When I tell people that I have lived in Costa Rica for 42 years, they inevitably ask me, “What brought you here in the first place.” I begin by telling them that my dream to live in paradise began as an undergraduate at U.C.L.A. when I was awarded a scholarship to study in Puebla, Mexico. That experience proved to be a watershed moment as I discover my love for Latin America and its fascinating culture. I immediately knew that I wanted to fulfill my dream by eventually living somewhere south of the border. Thus, the search for my future home began. At the time I was only twenty years old,  had to finish my undergraduate studies and really had no way of supporting myself while living abroad (The possibility of being an Internet nomad and working remotely was not an option then). So, the only choice I had at the time was to become a Spanish teacher and use my three-month summer vacations to continue honing my language skills abroad and to explore Mexico in depth as I searched for a spot where I would eventually settle. During my travels I visited almost every exotic beach and inland region of said country. While roaming around Mexico I came across San Blas — a lovely little fishing village in the State of Nayarit, Mexico. I ended spent two Christmas vacations there soaking up the sun and guzzling Mexican beer. While there I met an American who had traveled by motorcycle through Mexico and Central America.  All he could do was rave about Costa Rica which piqued my curiosity.  I was enamored with Mexico and its people but was always curious to see what the countries to the south were like. So, I bought a ticket to Costa Rica as soon as I had a couple of free weeks to explore the country. In the summer of 1978 I began my maiden voyage on LACSA (Costa Rica’s former national airline).  Upon arrival, I immediately noticed there was something different about the country. I basically traveled around the country blindly since there were no travel guidebooks in print at that time.  First, I visited the capital city of San José. Then on a whim I went to the Shangri-la-like   to the east which proved to be an excellent choice. I then went to Puntarenas, Jacó, Quepos and Manual Antonio. Believe me, at that time it was not easy to get from point A to point B because of the dismal state of the country’s roads and infrastructure. Everything was a real adventure in those days. After my initial trip the country grew on me so I visited almost every chance I could get and stayed a little longer each time. At that point in my life there only remained one more thing I needed to do before choosing Costa Rica: I had to see if there was any other country in Latin America that was better for living.  So, I took a six month leave of absence from my job and set out to explore South America. First, I flew from Costa Rica to Rio de Janeiro. Then I spent a couple weeks touring Argentina with some Argentine friends who I had met in the States. Then I spent the next two months  checking out Uruguay, Chile, Bolivia, Peru, Ecuador and Colombia. All of these countries had something to offer, but as a whole none could “hold a candle” to Costa Rica. Costa Rica’s friendly people, year-round spring-like weather, proximity to the U.S., natural beauty, lack of a military and peaceful traditions, opportunities for   to start a business at that time, vibrant culture and unique  lifestyle all combined to make it an overwhelming choice for my new home. I have never regretted my decision for an instant and feel extremely fortunate for having fulfilled my dream of living in what I feel is the best country on earth. Incidentally, I have a very wealthy Canadian friend whose hobby is travel. At one time or another he has visited every country in the world. I asked him, “What is the best country you have visited?, ”  to which he quicky replied, “Costa Rica.”  He then asked, “Why do you think I live here?”   © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/11/14/multitasking-garden-setting-aquaponics-home",
        "date": "November 14, 2021",
        "title": "A Multitasking Costa Rica Garden: Setting up Aquaponics at Home",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER If you are looking for more than lettuce greens and tomatoes from your home food garden, this may well be the solution: Over the past decade or so, inventive gardeners have come up with a marriage of horticulture and fish farming.  Through aquaponics, or aquaculture, a gardener raises edible fish as part of a hydroponics system that grows vegetables and herbs without soil. Per square foot, aquaponics can be one of the most productive forms of agriculture, and is a perfect example of a a self-sufficient assembly of plants and animals that functions like an ecosystem, producing food for people without creating waste products or pollution. The water from the fish tanks can be used by the plants as a soluble fertilizer, while the plants filter the water for the fish. There are dozens of different kinds of fish that can be used for small or large scale production.  An aquaponics system that is functioning well can produce veggies every three months and a generation of fish in 9 months to a year. Costa Rica’s tropical climate also favors production all year round, and varieties of fish such as tilapia and guapote are available here in the country. As in hydroponics, there is a tremendous savings in water use, since water is recycled again and again. First off, find the right place for your garden. Poor lighting will result in poor growth of the plants, so it’s very important that the site receive good morning sun. The site should receive 6-8 hours of sun daily.  This usually means the eastern and southern exposures of the home. One negative aspect of aquaponic systems is that they tend to cost a lot to get started, but you can save money by using recycled plastic contains for growing beds and fish tanks. Hydroponic systems also need careful attention to the quality of water for the fish. So let’s look at some of the different types of do-it-yourself aquaponics systems that gardeners can choose from for the home. There are plenty of tutorial videos and instructions online to help you set up your own aquaponic system.  Here are a few examples: A mini-garden container and aquarium setup is a nice way to start and a great project for the kids. Hook up the tray or container for lettuce or a tomato with a growing media, then connect to the aquarium with a small pump. This simple system helps the family learn how to manage the water quality for the fish. Remember to place the growing unit in a sunny area. See Aquaponics Journal. Vertical wall growing containers and a plastic barrel fish tank In small areas it’s not top hard to attach containers to a sunny wall and connect them to the fish tank via irrigation tubing and a small pump. Once again, you can save by using  filled with the appropriate growing media. Plastic barrel fish tanks and growing beds.  These days it’s easy to acquire these reused barrels at Costa Rican   or barrel depots found in every town.  These blue barrels can be cut in half length-wise to make two garden growing beds and another barrel to raise the fish in. This system is less expensive and works in small areas. PVC pipes connect the growing beds with the fish tank and a pump circulates the water. Greenhouse hydroponics with larger fish tanks for continued food production. As you can imagine, the more fish you want to propagate, the more growing beds you will need to filter the water. In theory, a well-tuned aquaponic system can support one pound of fish per gallon of water.  When starting out, however, it’s better to plan on stocking one fish for every 10 gallons of water to make sure the system doesn’t fall out of balance and the fish will have more room to swim.  Open water systems need screening to prevent mosquitoes from breeding in the system, like   which can carry dengue, chikungunya, and Zika viruses. Finally, there are several enterprises in Costa Rica that offer complete construction and maintenance of aquaponic systems. For example, in our hometown of San Isidro del General, local school Escuela del Valle has just received a donation of an aquaponic system that will act as a living laboratory for the students. Jim Gale of Permacube Revolution is putting the final touches on the project which includes aquaponics and more. It’s good to see that these types of educational programs are being started across the country to help our youth to become highly skilled in the art of home and community food production. When we can save money, eat healthier food, and help improve our environment, it’s a good step toward redesigning the habitats we live in. Here’s a directory of aquaponics supplies and services. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/11/23/tico-talk-for-expats-and-tourists-part-1",
        "date": "November 23, 2021",
        "title": "Learning Spanish In Costa Rica for Expats and Tourists",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER You can’t call yourself fluent in Costa Rican Spanish unless you understand its slang. as they are known, play an important role in most daily conversations. Despite having been a Spanish teacher for many years with a Masters Degree, I quickly found myself overwhelmed by Costa Rican slang when I moved here in 1980. I began an exhaustive study of the local lingo and compiled thousand of   or   (expressions) in the process. Learning these phrases will help you navigate Costa Rica’s linguistic jungle, especially if you plan to live here. I am going to start this series with some of the more commonly used terms. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2021/12/09/how-to-drivers-licenses-in-costa-rica",
        "date": "December 9, 2021",
        "title": "How to: Driver’s Licenses in Costa Rica",
        "content": "As part of the measures to combat the coronavirus pandemic, you   make an appointment.  .  as pointed out one our readers Dr. Morgan:  “if you are WAITING for your residency (i.e., have EXPEDIENTE papers), you still need to renew your entry permit every 90 days because using your foreign driver’s license is BASED ON the last entry stamp in your passport (regardless of how long your residency application takes). This is crazy, but many people don’t realize it until it is too late and they are caught driving without a “valid” extension to their foreign license.”"
    },
    {
        "url": "https://ticotimes.net/2022/01/31/voting-in-costa-rica-and-the-upcoming-election",
        "date": "January 31, 2022",
        "title": "Voting in Costa Rica and the Upcoming Election",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER As you travel along the roads of Costa Rica you are quickly reminded of the upcoming election. Whether it be a dirt road through a small town or village or a well-traveled route, no one is forgotten as every vote matters. This is because the general election is fast approaching and this Sunday, February 6, 2022 political changes will come to Costa Rica. But how do you become eligible to run for President and how can you still vote if you are a Costa Rican expat?  Lets discuss that and few more topics about the Costa Rica Presidential Elections. Every 4 years Costa Rica runs their direct elections where the country has the right to have their say in the direction Costa Rica will go in. It is at this time the people of Costa Rica will take to the polls to help determine Costa Rica’s next president and Legislative Assembly. However, in order to get on that ballot, there are several mandatory qualifications one must have if you are hoping to vie for the position of President of Costa Rica.  Unlike other country’s the president of Costa Rica cannot run for consecutive 4 year terms. It wasn’t until 2005 when candidates were permitted to run again, if they chose, but had to wait at least 8 years after governing in order to do so.  In order to win the presidential election, one must win at least 40% of the popular vote on February 6, 2022. If history is to repeat itself, this typically does not happen in the first round of votes and a runoff election follows if no one receives the 40%. The two candidates with the most votes will then take to the second-round ballot.  It will then be on April 3, 2022, as this is the required two months after the first round of votes when voters will return to determine who they feel will best govern Costa Rica. However, it is just the decision on who will be the next President that will be determined as the Legislative Assembly was decided on the first vote. The ability to vote has been made easy and accessible, however, making a decision of who you want to mark on your ballot may not come as easy. This national election has a record number of candidates on the ballot this time and may seem a bit overwhelming so being well informed on each candidate is of upmost importance.  There are a few faces many may recognize from the past with  s (National Liberation Party – PLN) seeking a return after serving as former head of state from 1994 – 1998 and Lineth Saborío of the Social Christian Unity Party (PUSC) and former Vice President of 2002-2006.  According to the   it is these familiar candidates leading the forefront of the election with Fabricio Alvarado of the New Republic party (PNR) following closely behind.  The Broad Front (FA) party’s José Maria Villalta and Social Democratic Progress (PSD) party Rodrigo Chaves close up the top 5 positions at the moment but nothing as yet be determined or predicted.  Along with these findings the most recent results from UCR also show that 41% have not yet decided on which candidate they will cast their vote for. That being said many will end up making their decision on who they will vote for in the days leading up to the election or even as they stand stare at the ballot just before voting. If you are not in the country at the time of the election you still have the ability to make a difference in the presidential election. You are eligible to vote in Costa Rica election if you are of the legal age of 18 and possess valid identification regardless whether you are living in Costa Rica or somewhere else in the world.  If you have become a naturalized Costa Rican citizen you are also able to taking advantage of being a citizen and you also have the right to vote.  For those abroad, there are 52 consulates from 42 different countries to allow those overseas to still be a part of your country’s decision. Polling stations have even been set up for registered voters  within Costa Rica to ensure the right to vote for prisoners. Any Costa Rica voter any will tell you that voting is both voluntary and symbolically required. However, it is, in fact, obligatory. However, in reality if you don’t show up at the ballot box there aren’t any legal problems or consequences for not voting as it’s not on the top of the list for those who enforce the issue.  You are more likely to have issues with those around you when complaining about who was elected since you didn’t make the effort to have your say in the matter. With the ever-changing state of the current world conditions, by voting, Costa Rica’s citizens can strive for a new government that will bring forth a sense of stability in an unstable world.  Remember every vote counts so if you are eligible to vote in the upcoming Sunday, February 6, 2022, Costa Rica general election be sure to have your say. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/10/03/costa-rica-coffee-industry-funds-research-with-nft-sales",
        "date": "October 3, 2023",
        "title": "Costa Rica Coffee Industry Funds Research with NFT Sales ",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER The Tropical Agricultural Research and Higher Education Centre (CATIE) and the Specialty Coffee Association of Costa Rica (SCACR) have partnered with non-fungible token ( ) distribution company BIOCENFT to launch a collection of NFTs inspired by 12 of CATIE’s coffee varieties. The funds raised from the sale of the NFTs will be used to support the research, conservation, and promotion of CATIE’s International Coffee Collection, considered the fourth largest in the world. The resources will also support the operations and financing of CATIE’s Genetic Improvement Department and SCACR. “This is a unique opportunity for coffee and NFT enthusiasts to support two important organizations that are working to ensure the future of Costa Rican coffee,” said BIOCENFT CEO Walter Aguilar. “BIOCENFT was created to facilitate fundraising for organizations or projects related to biodiversity protection and conservation, and we are proud to be able to support CATIE and SCACR in this important work.” The 12 available NFTs are inspired by the Geisha, Wush-Wush, Mibirizi, Java, Rume Sudan, ET-47, SL-28, SL-34, Centroamericano, Milenio, Esperanza, and Casiopea varieties. Each NFT features a unique design that showcases the unique characteristics of each coffee variety. “This is a great way to raise awareness of the importance of coffee biodiversity and to support the research and conservation efforts of CATIE and SCACR,” said SCACR Executive Director Noelia Villalobos. “The association will continue disseminating knowledge and promoting coffee culture nationally and internationally, and we are grateful for the opportunity to do this with the help of NFT technology.” The NFTs are available in Gold, Silver, and Standard editions, with investments ranging from US$20 to US$12,000. The sale and purchase of NFTs for this campaign can be found at  . This innovative partnership between  ,   and BIOCENFT is a testament to the creativity and ingenuity of the Costa Rican coffee industry. By using NFT technology to raise funds for research and conservation, these organizations are ensuring that Costa Rican coffee will continue to be enjoyed by people all over the world for generations to come. Of course, there are also some potential risks associated with this initiative. For example, the value of NFTs can be volatile, and there is a risk that investors could lose money. Additionally, some people may be skeptical of the use of NFTs for fundraising purposes. Overall, this NFT initiative is a bold and innovative step by CATIE, SCACR, and BIOCENFT. It has the potential to make a significant contribution to the research, conservation, and promotion of Costa Rican coffee. By supporting this NFT initiative, coffee lovers can help to ensure that   remains a sustainable and thriving industry for generations to come. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2022/12/24/old-traditions-like-nativity-scenes-rosaries-still-alive",
        "date": "December 24, 2022",
        "title": "Old Costa Rica Christmas Traditions like Nativity Scenes, Rosaries Still Alive",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Globalization has brought Christmas trees and overdressed Santa Clauses to tropical Costa Rica. But the old customs, those that came from Spain with the early settlers, still prevail. Other traditions, born here as a mixture of cultures, have been part of the holidays as long as anyone can remember. The  or  , the nativity scene, is still the most important part of Christmas in Costa Rica. It must, at least, include the three figures of the Holy Family, one cow and one donkey. The figure of Jesus is added at midnight on  , Christmas Eve.  In most homes, a variety of other figures have been added to the scene: shepherds, sheep and angels, mainly, but also chickens, roosters, cats and dogs. The nativity scene begins with  or moss, found around trees in the woods and colored in sandy hues to landscape around the stable, cave, hut or shoebox that comprises the home where Jesus made his first appearance. Add cypress branches, potted plants, stars and creativity, and each   is unique. Recent years have brought about a revival of interest in nativity scenes, with neighborhood contests and ingenuity producing wondrous tableaux with blinking lights, flowing water and recorded hymns. Families add whatever feels important, such as photographs of family members. Some neighborhoods host live   with humans portraying the Holy Family, complete with incongruities such as shepherds wearing watches or Jesus squalling from the itchy hay while friends and neighbors crowd around to say the rosary and sing  , or carols.  Figures of the three kings, with or without camels, make their appearance on Jan. 6, and many Ticos celebrate the day with a rosary. Rosaries to the Christ child are still popular, with friends and neighbors meeting at a home to recite the rosary in front of the nativity scene, followed by cookies,  or   (eggnog). Years ago, everyone had a rosary, so you went to one every night. In some homes, guitar music and singing accompany this custom. Christmas presents and toys for the children did not become a custom until the 1880s or so, when German merchants, among them Lehmann (of Librería Lehmann) and Federspiel (of Librería Universal), opened stores here.  In the far-off   or countryside, children received homemade toys, wooden trucks and oxcarts and dolls made at home. Toy oxen were made of corncobs and carts from sardine tins. Toys and sometimes coins were found under pillows on Christmas morning, sneaked in by the Christ child. This article first appeared in 2010 © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/01/10/what-are-espresso-blends",
        "date": "January 10, 2023",
        "title": "What are Espresso Blends?",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER An espresso blend is a mixture of coffee beans that are roasted and ground specifically for use in making espresso. Espresso is a type of coffee that is made by forcing pressurized hot water through finely ground coffee beans. It is characterized by its strong, full-bodied flavor and thick, creamy texture. Espresso blends are typically made from a combination of Arabica and Robusta coffee beans, which are roasted to a dark level to bring out their full flavor. The specific blend of beans and the roast level can vary depending on the desired flavor profile of the final espresso. Some common flavor profiles   blends include nutty, chocolatey, and fruity. There are several factors that can contribute to the quality of an espresso blend:  The beans used in an espresso blend can have a big impact on the flavor of the final product. Arabica beans are known for their sweeter, fruitier flavors, while Robusta beans have a more bitter, earthy taste. The specific region where the beans are grown can also affect their flavor.  The roast level of the beans can also impact the flavor of the espresso. A lighter roast will result in a brighter, more acidic flavor, while a darker roast will produce a more intense, bold flavor.  Freshly roasted beans will produce a better-tasting espresso than beans that have been sitting on a shelf for a long time.  The beans should be ground finely to ensure that the water can extract all of the flavors and oils from the beans during the brewing process.  The quality of the water used to brew the espresso can also affect the final flavor. Use purified water to ensure that any impurities do not interfere with the flavor of the espresso. Designing an espresso blend involves selecting the right types and proportions of coffee beans, roasting them to the desired level, and then blending them together to create the desired flavor profile. Here are the steps involved in designing an espresso blend:  Choose the beans that you want to use in your blend. This can include a combination of Arabica and Robusta beans, as well as beans from different regions and with   Decide on the roast level for the beans. A lighter roast will result in a brighter, more acidic flavor, while a darker roast will produce a more intense, bold flavor. Mix together the chosen beans in the desired proportions to create the final blend. Grind the roasted beans finely and brew them using an espresso machine to create the final espresso blend. It may take some experimentation to find the right combination of beans and roast level to create the desired flavor profile for your espresso blend. 1.   – 60% Brazil, 20% Colombia 20 % Guatemala 2.   – 60% Brazil 20% Uganda 3.  – 60% Brazil 20% Yemen 20% Ethiopia 4.  – 60% Brazil 25% Ethiopia 25% Sumatra 5.   – 50% Colombia 25% Guatemala 25% Uganda 6.   – 55% Brazil 20% Ethiopia 15% Indian Monsoon Malabar 10% Uganda Espresso is best made with a medium to dark roast. A medium roast will have a balanced flavor with a slight sweetness and acidity, while a dark roast will have a fuller body and a slightly bitter flavor. It’s important to note that the roast level is just one factor that can affect the flavor of espresso, and the beans you use, the grind size, and the brewing process are all important as well. Ultimately, the best roast for espresso will depend on your personal taste preferences and the specific beans you are using.  is generally considered to be stronger in flavor than other types of coffee, but it is not necessarily stronger in terms of caffeine content. Espresso is made by forcing pressurized hot water through finely ground coffee beans, which extracts a concentrated shot of coffee with a strong, full-bodied flavor. However, because espresso is made in such small quantities (typically just 1-2 ounces per serving), it does not contain as much caffeine as a larger serving of regular drip coffee. That being said, the caffeine content of espresso can vary depending on the beans used, the roast level, and the brewing method. Some espresso blends may have a higher caffeine content than others, and some brewing methods may extract more caffeine from the beans than others. Overall, the caffeine content of espresso is similar to that of other types of coffee, but the concentrated flavor of espresso can make it seem stronger. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/02/13/aussie-cafe-offers-panamanian-coffee-at-140-a-cup",
        "date": "February 13, 2023",
        "title": "Aussie Cafe offers Panamanian Coffee at $140 a Cup",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Melbourne has long been famed for its  , with Italian and Greek migrants infusing the city with all things bean and cup since the 1940s. And, at US$140 a pop, one cafe in Melbourne, Australia is serving up no ordinary cup of joe. And for those looking for a next-level experience, one cafe is selling a cup at 50 times the price of a regular flat white or  . The coffee — hailed as one of the world’s finest — is grown in Panama’s Chiriqui region. Dubbed “Black Jaguar”, the beans came first at the prestigious 2022 Best of Panama auction in the   category, scoring 96.5 out of 100. They sold for over US$2,000 per pound (450 grams). Only 100 pounds were up for grabs and Australian cafe group Proud Mary snapped up a pound. “I had an out-of-body, enlightened kind of tingle. It was really clearly a special cup of coffee, taste-wise, character-wise,” said Proud Mary owner Nolan Hirte, who was on the judging panel. “It was right in your face, so expressive and so clear. “There’s something about it that’s just ‘wow’.” The Black Jaguar is the most expensive coffee Proud Mary has ever bought. They made 22 cups available in Melbourne, and a limited amount was stocked at their cafes in Austin and Portland in the United States. One connoisseur flew two hours from Sydney to buy the deluxe drop, which is served as a  . Melbourne is one of the richest cities in one of the richest countries in the world. Even so, US$140 is well above what most people would pay for a cup of coffee. But cinematographer Jake Reeder, a self-described “massive coffee nerd” who won a taste of the Black Jaguar in a competition, said he would have no qualms paying for it. The 27-year-old described it as a “moving experience”. “Anytime you’re on the receiving end of a product that’s received so much love and care and attention,” he said, “it makes you feel something.” Hirte believes coffee is a snip compared with more expensive drinks such as wine and tea. “Coffee is far more complex than wine will ever be, but it often gets roasted dark, has sugar added to it and milk poured on it — it can be so much more,” he said. “And does anyone talk about how expensive tea can be, because it outplays coffee massively.” “Why are we trying to hold it back, to think coffee can just have a ceiling?” © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/02/17/the-rise-of-green-coffee",
        "date": "February 17, 2023",
        "title": "Growing and Roasting Coffee at Home",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER According to the studies done recently, green coffee contains a powerful antioxidant called chlorogenic acid, which can help to reduce blood pressure and cholesterol levels.  The antioxidant capacity of chlorogenic acid is said to be more potent than of   (vitamin C). It also signals the body to burn up stored fat. Roasted coffee beans lose the greater part of this compound, but green beans contain around 85 mg/gram of coffee. These chlorogenic acids could be a valuable, inexpensive source of antioxidants. Pricy green coffee bean extracts are now being marketed as a supplement, which prompted me  to ask,   So, I blended 1 tablespoon of green coffee with a cup of water, strained the mix and came up with my own version of a green coffee drink. The taste is fine, and it seems like it could be mixed with vegetable or fruit juices to make a truly healthy beverage.  Green coffee beans may be another reason to grow coffee plants around the home for your own cup of java, but the big reason may be this. The government has tried to boost Costa Rica’s coffee production due to the leaf disease known as  and an insect called  , a weevil that bores into the coffee bean. The government’s plan includes loans to coffee growers to buy more pesticides! That means commercial coffee will now come with an extra dose of toxic residue.      is less likely to be bothered by pests and disease than coffee grown in large monoculture farms. With good applications of organic fertilizers, coffee plants thrive. As for the weevil, you can make a simple attractant trap from recycled plastic bottles. Coffee’s attractive, shiny, evergreen leaves, fragrant, star-like white flowers and bright red berries make coffee a useful ornamental shrub.  Each year a mature coffee plant can produce about 1 pound of processed coffee. Most coffee cooperatives around the country offer young plants for sale or you can try starting them from seeds.  You may also spray the plants with seaweed extract ( ) and grapefruit seed oil extract ( ) to keep them free of leaf diseases, like  . The first harvest for young coffee plants comes in the third year, and they may continue in production for more than 20 years. To process the coffee beans, which are   you must remove the cherry-like fruit pulp from the seeds with a hand corn grinder ( ), which has been opened all the way to permit the seeds to pass through without damaging them.  The pulp can then be separated from the seeds by washing them in a 5-gallon bucket or tub. The pulp will float and can be scooped off the surface of the water.  Next, you’ll need to dry the beans in the sun on screens or trays until they are crisp. The coffee beans can be stored at this stage or passed once again through the corn grinder, but this time with a slightly tighter setting, so the outer husk of the seed will be removed.  This paper-like skin is called  in Spanish or parchment Now you can toast the coffee beans, preferably in a large cast iron skillet. Here you can custom roast the coffee; light brown for a mild flavor or almost black for a strong blend.  The toasted beans are then ground in a small coffee grinder, a blender or the corn grinder with a tight setting. Although coffee can be considered a cardio-stimulant and a good laxative, excessive use of coffee can cause secondary effects, such as nervousness, irritability, insomnia, muscle tension, high blood pressure, heart palpitations, stomach distress, gastritis, ulcers and poor assimilation of nutrients in the intestines.  So, for your own well-being, try cutting down on your coffee intake. And for a healthier planet, try growing some eco-friendly coffee right at home.  © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/05/02/climate-change-threatens-costa-rica-coffee-industry-how-farmers-are-adapting",
        "date": "May 2, 2023",
        "title": "Climate Change Threatens Costa Rica Coffee Industry: How Farmers are Adapting",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Coffee in Costa Rica is not just a beverage; it’s a way of life and it represents a significant portion of the country’s economy. Coffee cultivation in Costa Rica dates back to the 1700s when the first plants were introduced by the Spanish colonialists.  Since then, coffee has become an integral part of  , and it’s a source of national pride. Unfortunately, the coffee industry in the country is facing numerous challenges, including the impacts of climate change. According to a report by  climate change is posing a significant threat to the coffee farmers of Costa Rica. The report states that an increase in temperature and erratic rainfall patterns are creating numerous challenges for the coffee growers in the country. The situation is highly complicated as temperatures continue to increase, especially during coffee growing and harvest season. This has resulted in a shift in the window for coffee picking, making crop yields unpredictable and creating problems in planning harvest schedules. Additionally, Costa Rica’s monthly rainfall has been increasing considerably, and while this might generally be favorable, it has increased the risk of fungal infections for the coffee plants during the growth season. The increase in rainfall has also made it challenging for farmers to predict the best times for fertilizing their crops, leading to suboptimal growth and yield. Another significant challenge facing coffee farmers in Costa Rica is the need to minimize their environmental impact.   is a high-risk business, with significant initial investments and increasing costs of maintaining farms. As a result, many farmers are clearing more forests to increase their yields and find more arable land.  This poses a significant threat to the ecosystem and makes it challenging for farmers to balance their need for income with their responsibility to protect the environment. Despite these challenges,  are not giving up easily. They are working tirelessly to adapt and turn their production methods into eco-friendly practices that will allow them to boost production while preserving the environment. Farmers are collaborating with environmentalists and researchers to develop sustainable plans and solutions that will help them keep doing what they love while preserving the ecosystem. One of the solutions proposed by experts is the adoption of agroforestry, which involves planting coffee trees in the shade of taller trees. This not only provides a conducive environment for coffee growth but also helps to preserve the ecosystem by reducing the need for clearing more forests. Farmers can also adopt practices such as composting, intercropping, and natural pest control, which help to reduce their environmental impact. The coffee industry is vital to the country’s economy, but it’s facing numerous challenges, including the impacts of climate change. However, despite the hardships, Costa Rican coffee farmers are determined to adapt and find sustainable solutions to protect the environment while continuing to produce their beloved coffee.  As consumers, we can support these efforts by choosing to buy coffee from farmers who use sustainable and eco-friendly practices, ensuring that we’re not just enjoying a cup of coffee but also contributing to a better world. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/08/29/costa-rica-and-colombia-to-partner-on-coffee-quality-and-pricing",
        "date": "August 29, 2023",
        "title": "Costa Rica and Colombia to Partner on Coffee Quality and Pricing",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER The presidents of Costa Rica and Colombia agreed this week to a joint initiative to promote and defend high-quality coffee in order to increase prices and income for farmers in both nations. The announcement came during Colombian President Gustavo Petro’s official visit to Costa Rica, marking his first trip to Central America since assuming office last year. In a press conference with Costa Rican leader Rodrigo Chaves, Petro emphasized the need for producing countries to capture more value from their premium coffee. “The purpose is for the added value of our coffee to be generated in our own producing countries, and not have that experience that has left little wealth in our countries from selling coffee in grain or raw form,” Petro stated. Both Colombia and Costa Rica have seen decreasing coffee exports recently, prompting the leaders’ pledge to work together. By differentiating their coffees via denomination of origin certifications and promoting unique qualities, they aim to transition away from selling raw commodity beans and towards specialized, higher-priced coffee. “Coffee, should cease to be a ‘commodity,'” noted Chaves, echoing Petro’s sentiments. “We are still coffee people, we have diversified, but we are leaving money on the table.” Beyond jointly promoting their   abroad, the partnership will explore opportunities for increased domestic coffee processing and value addition. This aims to nurture a richer coffee culture directly within Colombia and Costa Rica as well. “We have talked about joining forces” between the two historic coffee producers, Petro emphasized. In addition to the coffee alliance, the visiting delegation discussed cooperation on tourism, security, and managing regional migration flows. The forced migration situation through the   on the Colombia-Panama border was noted as requiring a coordinated Latin American response. Over 307,000 migrants have crossed into Panama already this year, with many eventually arriving in Costa Rica en route to North America. While short on details, the high-level coffee agreement signifies important coordination between two influential players. As coffee production faces pressures from climate change and economic volatility globally, joint strategies to boost sustainability and income for growers are increasingly necessary. Colombia and Costa Rica also share an opportunity to shift perceptions and educate consumers about the craft behind a truly exceptional cup of coffee. If realized, this vision could extend benefits throughout local coffee-growing communities in both nations. © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/09/10/wild-brazilian-pheasants-produce-expensive-jacu-coffee",
        "date": "September 10, 2023",
        "title": "Wild Brazilian Pheasants Produce Expensive Jacu Coffee",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER In Brazil, the proverbial goose that lays the golden egg is in reality something closer to a pheasant that excretes coffee beans. At the Camocim coffee farm, deep in the bucolic hills of Espirito Santo state in Brazil’s southeast, jacus — a type of pheasant native to tropical forests there — are considered some of the most astute pickers (or rather, eaters) of coffee cherries. “He chooses the best fruits, the ripest,” said worker Agnael Costa, 23, delicately scooping up droppings left behind by one of the birds between two tree trunks.  What goes in as ripe cherries comes out as beans, which can go on to be sold as some of the most delicious — and expensive — coffee in the world. The coffee at Camocim grows in the middle of the lush forest, and the jacus here are wild, eating (and defecating) at their own pace. “It was this agroforestry system that created the necessary conditions for this exotic coffee to exist here,” said farm owner Henrique Sloper. Domestically, jacu coffee can sell for 1,118 reais per kilogram (or around $100 a pound) — a price that can rise significantly upon export. Foreign distributors include British department store Harrods, among others.  The jacu, with its black feathers and red throat, wasn’t always welcome at the farm. It was originally seen as a hungry pest feeding off precious crops. But when Sloper discovered “kopi luwak,” an expensive Indonesian coffee made with beans from civet excrement, he figured jacus might make good allies in the quest to make a better brew. sometimes has a bad reputation, with farmers accused of pressing civets — small mammals similar to weasels — into captivity to boost production.  The wild jacus at Camocim, meanwhile, roam, eat and poop at their leisure. “It’s 100 percent natural,” said farm production supervisor Rogerio Lemke. “The jacu is within its own natural habitat,” in Brazil’s Atlantic Forest. Linking production to the whims of a jacu’s appetite is just one of the reasons it fetches such a high price. Jacu droppings look a bit like a cereal bar, with beige grains protruding from a blackish, pasty mess. Once collected and dried, the beans are carefully sorted and hulled, and put into a chilled room. “It is naturally expensive. There is no way to make a jacu coffee at a low cost,” says Sloper. All told, jacu coffee represents less than 2 percent of the estate’s production. The bird also carries other advantages, both for farmers and those seeking a cheaper — if less intestinally intimate — cup of Joe. “It serves not only as a selector (of the best beans), but also as a harvest alarm” says Sloper. “Where it eats, the coffee is ripe.” While jacus help select the best coffee, there’s nothing in particular about their digestive system that imparts a different taste on the beans. “The birds have an extremely short intestinal transit time,” said Ensei Neto, a coffee specialist. “So there is not exactly any kind of biochemical process, there is no time.” Their digestive process is much faster than civets or elephants — another animal whose dung is used, in Thailand, to produce specialty coffee.  Some think the fermentation process stemming from those animals’ longer digestion times imparts a better flavor on the resulting beans.  The jacu “only goes for the ripe fruits,” says Neto, producing a coffee with “sweet notes, with good acidity.” “It doesn’t add anything else. But the story is good.” The jacus have found a fan in Poliana Cristiana Prego, 37, a Brazilian tourist who has come to visit Camocim. “It’s a delicious coffee and the story behind its production is very original. It’s a new experience for us,” she says. “Our customers are lovers of exotic products, but also those who value the idea of sustainable development,” says Sloper. For him, “the future of coffee will come from Brazil,” already the world’s top producer.  Whether it comes from jacus or otherwise, Brazilian coffee “is showing the world that we really are able to do what nobody else can.” © 2023 The Tico Times"
    },
    {
        "url": "https://ticotimes.net/2023/09/12/beyond-the-bean-costa-ricas-coffee-antibiotic-breakthrough",
        "date": "September 12, 2023",
        "title": "Beyond the Bean: Costa Rica’s Coffee Antibiotic Breakthrough",
        "content": "COSTA RICA'S LEADING ENGLISH LANGUAGE NEWSPAPER Researchers from the University of Costa Rica (UCR) have shed light on an unexpected potential of a coffee by-product, coffee mucilage. Historically overlooked, this substance has demonstrated significant antimicrobial properties, building on the already known ability of certain coffee components to inhibit bacterial growth. The groundbreaking study, directed by Dr. Carolina Chaves Ulate of UCR’s Faculty of Microbiology, examined the specific chemical compounds found in the mucilage, particularly polyphenols. Results illustrated their ability to halt the growth of eight bacteria responsible for food spoilage and stymie the proliferation of several harmful human pathogens. This opens a promising door for the coffee industry and healthcare alike, potentially offering a new resource for antibiotic development. As Dr. Ulate clarified, the focus was on exploring the compounds within the coffee bean – a major export product of Costa Rica. The research, whose findings are published in the NFS Journal, aimed to derive value from what is currently viewed as a waste product in coffee processing. Dr. Ulate’s colleagues, Drs. Rodríguez Sánchez, Arias Echandi, and Patricia Esquivel collaborated on this pioneering effort. While the application of these findings might seem distant, the implications are substantial. The coffee industry is monumental, with yearly international revenues nearing $10 billion. However, the environmental footprint is concerning; globally, over 2 billion tons of coffee by-products, mainly discarded, are produced. By turning mucilage into a potential commodity, the ecological and economic impact could be profound. Beyond economic and environmental considerations, the research resonates with global healthcare concerns. The rise of antimicrobial-resistant bacteria threatens the efficacy of existing drugs, underscoring the urgency for new antibiotic sources. The World Health Organization and other entities have already highlighted the escalating danger of drug-resistant infections. Interestingly, the study showed that the polyphenolic compounds did not inhibit beneficial gut bacteria. This selectivity can play a pivotal role in future antimicrobial development. One standout finding was the strong inhibitory effect on Bacillus cereus, a food contaminant. Other pathogens impacted included Micrococcus luteus, Listeria monocytogenes, and Staphylococcus aureus. However, several other bacteria like Escherichia coli and Salmonella remained unaffected. With these findings, UCR researchers are already investigating further. They aim to assess the effect of mucilage polyphenols on bacterial spores, nature’s own “preservation” method for bacteria. Preliminary indications suggest mucilage compounds might influence these spores, potentially leading to innovative disinfectant products. The   has surfaced as a promising agent in the fight against bacterial infections. This discovery could reshape the coffee industry, simultaneously addressing ecological concerns and global health challenges. © 2023 The Tico Times"
    }
]